nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
#define FREQME_FREQMECTRL_W_PULSE_MODE_MASK      (0x100U)
#define FREQME_FREQMECTRL_W_PULSE_MODE_SHIFT     (8U)
/*! PULSE_MODE - Pulse Width Measurement mode select
 *  0b0..Frequency Measurement Mode. FREQMECTRL works in a Frequency Measurement mode. Once the measurement starts
 *       (real count start is aligned at rising edge arrival on reference clock), the target counter increments by
 *       the target clock until the reference counter running by the reference clock reaches the count end point
 *       selected by REF_SCALE.
 *  0b1..Pulse Width Measurement mode. FREQMECTRL works in a Pulse Width Measurement mode, measuring the high or
 *       low period of reference clock input selected by PULSE_POL. The target counter starts incrementing by the
 *       target clock once a corresponding trigger edge (rising edge for high period measurement and falling edge for
 *       low period) occurs.
 */
#define FREQME_FREQMECTRL_W_PULSE_MODE(x)        (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRL_W_PULSE_MODE_SHIFT)) & FREQME_FREQMECTRL_W_PULSE_MODE_MASK)

#define FREQME_FREQMECTRL_W_PULSE_POL_MASK       (0x200U)
#define FREQME_FREQMECTRL_W_PULSE_POL_SHIFT      (9U)
/*! PULSE_POL - Pulse Polarity
 *  0b0..High Period. High period of reference clock is measured in Pulse Width Measurement mode triggered by the
 *       rising edge on the reference clock input.
 *  0b1..Low Period. Low period of reference clock is measured in Pulse Width Measurement mode triggered by the
 *       falling edge on the reference clock input.
 */
#define FREQME_FREQMECTRL_W_PULSE_POL(x)         (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRL_W_PULSE_POL_SHIFT)) & FREQME_FREQMECTRL_W_PULSE_POL_MASK)

#define FREQME_FREQMECTRL_W_LT_MIN_INT_EN_MASK   (0x1000U)
#define FREQME_FREQMECTRL_W_LT_MIN_INT_EN_SHIFT  (12U)
/*! LT_MIN_INT_EN - Less Than Minimum Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define FREQME_FREQMECTRL_W_LT_MIN_INT_EN(x)     (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRL_W_LT_MIN_INT_EN_SHIFT)) & FREQME_FREQMECTRL_W_LT_MIN_INT_EN_MASK)

#define FREQME_FREQMECTRL_W_GT_MAX_INT_EN_MASK   (0x2000U)
#define FREQME_FREQMECTRL_W_GT_MAX_INT_EN_SHIFT  (13U)
/*! GT_MAX_INT_EN - Greater Than Maximum Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define FREQME_FREQMECTRL_W_GT_MAX_INT_EN(x)     (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRL_W_GT_MAX_INT_EN_SHIFT)) & FREQME_FREQMECTRL_W_GT_MAX_INT_EN_MASK)

#define FREQME_FREQMECTRL_W_RESULT_READY_INT_EN_MASK (0x4000U)
#define FREQME_FREQMECTRL_W_RESULT_READY_INT_EN_SHIFT (14U)
/*! RESULT_READY_INT_EN - Result Ready Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define FREQME_FREQMECTRL_W_RESULT_READY_INT_EN(x) (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRL_W_RESULT_READY_INT_EN_SHIFT)) & FREQME_FREQMECTRL_W_RESULT_READY_INT_EN_MASK)

#define FREQME_FREQMECTRL_W_CONTINUOUS_MODE_EN_MASK (0x40000000U)
#define FREQME_FREQMECTRL_W_CONTINUOUS_MODE_EN_SHIFT (30U)
/*! CONTINUOUS_MODE_EN - Continuous Mode Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define FREQME_FREQMECTRL_W_CONTINUOUS_MODE_EN(x) (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRL_W_CONTINUOUS_MODE_EN_SHIFT)) & FREQME_FREQMECTRL_W_CONTINUOUS_MODE_EN_MASK)

#define FREQME_FREQMECTRL_W_MEASURE_IN_PROGRESS_MASK (0x80000000U)
#define FREQME_FREQMECTRL_W_MEASURE_IN_PROGRESS_SHIFT (31U)
/*! MEASURE_IN_PROGRESS - Measure in Progress
 *  0b0..Force Terminate
 *  0b1..Initiates Measurement Cycle
 */
#define FREQME_FREQMECTRL_W_MEASURE_IN_PROGRESS(x) (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRL_W_MEASURE_IN_PROGRESS_SHIFT)) & FREQME_FREQMECTRL_W_MEASURE_IN_PROGRESS_MASK)
/*! @} */

/*! @name FREQMECTRLSTAT - Frequency Measurement Control Status */
/*! @{ */

#define FREQME_FREQMECTRLSTAT_REF_SCALE_MASK     (0x1FU)
#define FREQME_FREQMECTRLSTAT_REF_SCALE_SHIFT    (0U)
/*! REF_SCALE - Reference Scale Value
 */
#define FREQME_FREQMECTRLSTAT_REF_SCALE(x)       (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRLSTAT_REF_SCALE_SHIFT)) & FREQME_FREQMECTRLSTAT_REF_SCALE_MASK)

#define FREQME_FREQMECTRLSTAT_PULSE_MODE_MASK    (0x100U)
#define FREQME_FREQMECTRLSTAT_PULSE_MODE_SHIFT   (8U)
/*! PULSE_MODE - Pulse Mode Status
 */
#define FREQME_FREQMECTRLSTAT_PULSE_MODE(x)      (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRLSTAT_PULSE_MODE_SHIFT)) & FREQME_FREQMECTRLSTAT_PULSE_MODE_MASK)

#define FREQME_FREQMECTRLSTAT_PULSE_POL_MASK     (0x200U)
#define FREQME_FREQMECTRLSTAT_PULSE_POL_SHIFT    (9U)
/*! PULSE_POL - Pulse Polarity Status
 */
#define FREQME_FREQMECTRLSTAT_PULSE_POL(x)       (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRLSTAT_PULSE_POL_SHIFT)) & FREQME_FREQMECTRLSTAT_PULSE_POL_MASK)

#define FREQME_FREQMECTRLSTAT_LT_MIN_INT_EN_MASK (0x1000U)
#define FREQME_FREQMECTRLSTAT_LT_MIN_INT_EN_SHIFT (12U)
/*! LT_MIN_INT_EN - Less Than Minimum Interrupt Enable Status
 */
#define FREQME_FREQMECTRLSTAT_LT_MIN_INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRLSTAT_LT_MIN_INT_EN_SHIFT)) & FREQME_FREQMECTRLSTAT_LT_MIN_INT_EN_MASK)

#define FREQME_FREQMECTRLSTAT_GT_MAX_INT_EN_MASK (0x2000U)
#define FREQME_FREQMECTRLSTAT_GT_MAX_INT_EN_SHIFT (13U)
/*! GT_MAX_INT_EN - Greater Then Maximum Interrupt Enable Status
 */
#define FREQME_FREQMECTRLSTAT_GT_MAX_INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRLSTAT_GT_MAX_INT_EN_SHIFT)) & FREQME_FREQMECTRLSTAT_GT_MAX_INT_EN_MASK)

#define FREQME_FREQMECTRLSTAT_RESULT_READY_INT_EN_MASK (0x4000U)
#define FREQME_FREQMECTRLSTAT_RESULT_READY_INT_EN_SHIFT (14U)
/*! RESULT_READY_INT_EN - Result Ready Interrupt Enable Status
 */
#define FREQME_FREQMECTRLSTAT_RESULT_READY_INT_EN(x) (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRLSTAT_RESULT_READY_INT_EN_SHIFT)) & FREQME_FREQMECTRLSTAT_RESULT_READY_INT_EN_MASK)

#define FREQME_FREQMECTRLSTAT_LT_MIN_STAT_MASK   (0x1000000U)
#define FREQME_FREQMECTRLSTAT_LT_MIN_STAT_SHIFT  (24U)
/*! LT_MIN_STAT - Less Than Minimum Results Status
 */
#define FREQME_FREQMECTRLSTAT_LT_MIN_STAT(x)     (((uint32_t)(((uint32_t)(x)) << FREQME_FREQMECTRLSTAT_LT_MIN_STAT_SHIFT)) & FREQME_FREQMECTRLSTAT_LT_MIN_STAT_MASK)

