nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
#define I3C_SMAPCTRL0_DA_MASK                    (0xFEU)
#define I3C_SMAPCTRL0_DA_SHIFT                   (1U)
/*! DA - Dynamic Address
 */
#define I3C_SMAPCTRL0_DA(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_SMAPCTRL0_DA_SHIFT)) & I3C_SMAPCTRL0_DA_MASK)

#define I3C_SMAPCTRL0_CAUSE_MASK                 (0x700U)
#define I3C_SMAPCTRL0_CAUSE_SHIFT                (8U)
/*! CAUSE - Cause
 */
#define I3C_SMAPCTRL0_CAUSE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_SMAPCTRL0_CAUSE_SHIFT)) & I3C_SMAPCTRL0_CAUSE_MASK)
/*! @} */

/*! @name IBIEXT1 - Extended IBI Data 1 */
/*! @{ */

#define I3C_IBIEXT1_CNT_MASK                     (0x7U)
#define I3C_IBIEXT1_CNT_SHIFT                    (0U)
/*! CNT - Count
 */
#define I3C_IBIEXT1_CNT(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT1_CNT_SHIFT)) & I3C_IBIEXT1_CNT_MASK)

#define I3C_IBIEXT1_MAX_MASK                     (0x70U)
#define I3C_IBIEXT1_MAX_SHIFT                    (4U)
/*! MAX - Maximum
 */
#define I3C_IBIEXT1_MAX(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT1_MAX_SHIFT)) & I3C_IBIEXT1_MAX_MASK)

#define I3C_IBIEXT1_EXT1_MASK                    (0xFF00U)
#define I3C_IBIEXT1_EXT1_SHIFT                   (8U)
/*! EXT1 - Extra byte 1
 */
#define I3C_IBIEXT1_EXT1(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT1_EXT1_SHIFT)) & I3C_IBIEXT1_EXT1_MASK)

#define I3C_IBIEXT1_EXT2_MASK                    (0xFF0000U)
#define I3C_IBIEXT1_EXT2_SHIFT                   (16U)
/*! EXT2 - Extra byte 2
 */
#define I3C_IBIEXT1_EXT2(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT1_EXT2_SHIFT)) & I3C_IBIEXT1_EXT2_MASK)

#define I3C_IBIEXT1_EXT3_MASK                    (0xFF000000U)
#define I3C_IBIEXT1_EXT3_SHIFT                   (24U)
/*! EXT3 - Extra byte 3
 */
#define I3C_IBIEXT1_EXT3(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT1_EXT3_SHIFT)) & I3C_IBIEXT1_EXT3_MASK)
/*! @} */

/*! @name IBIEXT2 - Extended IBI Data 2 */
/*! @{ */

#define I3C_IBIEXT2_EXT4_MASK                    (0xFFU)
#define I3C_IBIEXT2_EXT4_SHIFT                   (0U)
/*! EXT4 - Extra byte 4
 */
#define I3C_IBIEXT2_EXT4(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT2_EXT4_SHIFT)) & I3C_IBIEXT2_EXT4_MASK)

#define I3C_IBIEXT2_EXT5_MASK                    (0xFF00U)
#define I3C_IBIEXT2_EXT5_SHIFT                   (8U)
/*! EXT5 - Extra byte 5
 */
#define I3C_IBIEXT2_EXT5(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT2_EXT5_SHIFT)) & I3C_IBIEXT2_EXT5_MASK)

#define I3C_IBIEXT2_EXT6_MASK                    (0xFF0000U)
#define I3C_IBIEXT2_EXT6_SHIFT                   (16U)
/*! EXT6 - Extra byte 6
 */
#define I3C_IBIEXT2_EXT6(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT2_EXT6_SHIFT)) & I3C_IBIEXT2_EXT6_MASK)

#define I3C_IBIEXT2_EXT7_MASK                    (0xFF000000U)
#define I3C_IBIEXT2_EXT7_SHIFT                   (24U)
/*! EXT7 - Extra byte 7
 */
#define I3C_IBIEXT2_EXT7(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_IBIEXT2_EXT7_SHIFT)) & I3C_IBIEXT2_EXT7_MASK)
/*! @} */

/*! @name SID - Slave Module ID */
/*! @{ */

#define I3C_SID_ID_MASK                          (0xFFFFFFFFU)
#define I3C_SID_ID_SHIFT                         (0U)
/*! ID - ID
 */
#define I3C_SID_ID(x)                            (((uint32_t)(((uint32_t)(x)) << I3C_SID_ID_SHIFT)) & I3C_SID_ID_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group I3C_Register_Masks */


/* I3C - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral I3C0 base address */
  #define I3C0_BASE                                (0x50016000u)
  /** Peripheral I3C0 base address */
  #define I3C0_BASE_NS                             (0x40016000u)
  /** Peripheral I3C0 base pointer */
  #define I3C0                                     ((I3C_Type *)I3C0_BASE)
  /** Peripheral I3C0 base pointer */
  #define I3C0_NS                                  ((I3C_Type *)I3C0_BASE_NS)
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS                           { I3C0_BASE }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS                            { I3C0 }
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS_NS                        { I3C0_BASE_NS }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS_NS                         { I3C0_NS }
#else
  /** Peripheral I3C0 base address */
  #define I3C0_BASE                                (0x40016000u)
  /** Peripheral I3C0 base pointer */
  #define I3C0                                     ((I3C_Type *)I3C0_BASE)
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS                           { I3C0_BASE }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS                            { I3C0 }
#endif
/** Interrupt vectors for the I3C peripheral type */
#define I3C_IRQS                                 { I3C0_IRQn }

/*!
 * @}
 */ /* end of group I3C_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- INPUTMUX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INPUTMUX_Peripheral_Access_Layer INPUTMUX Peripheral Access Layer
 * @{
 */

/** INPUTMUX - Register Layout Typedef */
typedef struct {
  __IO uint32_t SCT0_INMUX[7];                     /**< Inputmux register for SCT0 input, array offset: 0x0, array step: 0x4 */
       uint8_t RESERVED_0[4];
  __IO uint32_t TIMER0CAP[4];                      /**< Capture select register for TIMER0 inputs, array offset: 0x20, array step: 0x4 */
  __IO uint32_t TIMER0TRIG;                        /**< Trigger register for TIMER0, offset: 0x30 */
       uint8_t RESERVED_1[12];
  __IO uint32_t TIMER1CAP[4];                      /**< Capture select register for TIMER1 inputs, array offset: 0x40, array step: 0x4 */
  __IO uint32_t TIMER1TRIG;                        /**< Trigger register for TIMER1, offset: 0x50 */
       uint8_t RESERVED_2[12];
  __IO uint32_t TIMER2CAP[4];                      /**< Capture select register for TIMER2 inputs, array offset: 0x60, array step: 0x4 */
  __IO uint32_t TIMER2TRIG;                        /**< Trigger register for TIMER2, offset: 0x70 */
       uint8_t RESERVED_3[44];
  __IO uint32_t EZHARCHB_INMUX[8];                 /**< Inputmux register for EZH arch B inputs, array offset: 0xA0, array step: 0x4 */
  __IO uint32_t PINTSEL[8];                        /**< Pin interrupt select, array offset: 0xC0, array step: 0x4 */
  __IO uint32_t DMA0_ITRIG_INMUX[32];              /**< Trigger select for DMA0 channel, array offset: 0xE0, array step: 0x4 */
  __IO uint32_t DMA0_OTRIG_INMUX[7];               /**< DMA0 output trigger selection for DMA0 input trigger, array offset: 0x160, array step: 0x4 */
       uint8_t RESERVED_4[4];
  __IO uint32_t FREQMEAS_REF;                      /**< Selection for frequency measurement reference clock, offset: 0x180 */
  __IO uint32_t FREQMEAS_TAR;                      /**< Selection for frequency measurement target clock, offset: 0x184 */
       uint8_t RESERVED_5[24];
  __IO uint32_t TIMER3CAP[4];                      /**< Capture select register for TIMER3 inputs, array offset: 0x1A0, array step: 0x4 */
  __IO uint32_t TIMER3TRIG;                        /**< Trigger register for TIMER3, offset: 0x1B0 */
       uint8_t RESERVED_6[12];
  __IO uint32_t TIMER4CAP[4];                      /**< Capture select register for TIMER4 inputs, array offset: 0x1C0, array step: 0x4 */
  __IO uint32_t TIMER4TRIG;                        /**< Trigger register for TIMER4, offset: 0x1D0 */
       uint8_t RESERVED_7[12];
  __IO uint32_t PINTSECSEL[2];                     /**< Pin interrupt secure select, array offset: 0x1E0, array step: 0x4 */
       uint8_t RESERVED_8[24];
  __IO uint32_t DMA1_ITRIG_INMUX[16];              /**< Trigger select for DMA1 channel, array offset: 0x200, array step: 0x4 */
  __IO uint32_t DMA1_OTRIG_INMUX[4];               /**< DMA1 output trigger selection for DMA1 input trigger, array offset: 0x240, array step: 0x4 */
       uint8_t RESERVED_9[16];
  __IO uint32_t HSCMP0_TRIG;                       /**< Input connections for HSCMP0, offset: 0x260 */
       uint8_t RESERVED_10[28];
  __IO uint32_t ADC0_TRIG[4];                      /**< ADC0 Trigger input connections, array offset: 0x280, array step: 0x4 */
       uint8_t RESERVED_11[48];
  __IO uint32_t ADC1_TRIG[4];                      /**< ADC1 Trigger input connections, array offset: 0x2C0, array step: 0x4 */
       uint8_t RESERVED_12[48];
  __IO uint32_t DAC0_TRIG;                         /**< DAC0 Trigger Inputs, offset: 0x300 */
       uint8_t RESERVED_13[28];
  __IO uint32_t DAC1_TRIG;                         /**< DAC1 Trigger Inputs, offset: 0x320 */
       uint8_t RESERVED_14[28];
  __IO uint32_t DAC2_TRIG;                         /**< DAC2 Trigger Inputs, offset: 0x340 */
       uint8_t RESERVED_15[28];
  __IO uint32_t ENC0_TRIG;                         /**< ENC0 Trigger Input Connections, offset: 0x360 */
  __IO uint32_t ENC0_HOME;                         /**< ENC0 Input Connections, offset: 0x364 */
  __IO uint32_t ENC0_INDEX;                        /**< ENC0 Input Connections, offset: 0x368 */
  __IO uint32_t ENC0_PHASEB;                       /**< ENC0 Input Connections, offset: 0x36C */
  __IO uint32_t ENC0_PHASEA;                       /**< ENC0 Input Connections, offset: 0x370 */
       uint8_t RESERVED_16[12];
  __IO uint32_t ENC1_TRIG;                         /**< ENC1 Trigger Input Connections, offset: 0x380 */
  __IO uint32_t ENC1_HOME;                         /**< ENC1 Input Connections, offset: 0x384 */
  __IO uint32_t ENC1_INDEX;                        /**< ENC1 Input Connections, offset: 0x388 */
  __IO uint32_t ENC1_PHASEB;                       /**< ENC1 Input Connections, offset: 0x38C */
  __IO uint32_t ENC1_PHASEA;                       /**< ENC1 Input Connections, offset: 0x390 */
       uint8_t RESERVED_17[12];
  __IO uint32_t PWM0_EXTSYNC[4];                   /**< PWM0 external synchronization, array offset: 0x3A0, array step: 0x4 */
  __IO uint32_t PWM0_EXTA[4];                      /**< PWM0 input trigger connections, array offset: 0x3B0, array step: 0x4 */
  __IO uint32_t PWM0_EXTFORCE;                     /**< PWM0 external force trigger connections, offset: 0x3C0 */
  __IO uint32_t PWM0_FAULT[4];                     /**< PWM0 fault input trigger connections, array offset: 0x3C4, array step: 0x4 */
       uint8_t RESERVED_18[12];
  __IO uint32_t PWM1_EXTSYNC[4];                   /**< PWM1 external synchronization, array offset: 0x3E0, array step: 0x4 */
  __IO uint32_t PWM1_EXTA[4];                      /**< PWM1 input trigger connections, array offset: 0x3F0, array step: 0x4 */
  __IO uint32_t PWM1_EXTFORCE;                     /**< PWM1 external force trigger connections, offset: 0x400 */
  __IO uint32_t PWM1_FAULT[4];                     /**< PWM1 fault input trigger connections, array offset: 0x404, array step: 0x4 */
       uint8_t RESERVED_19[12];
  __IO uint32_t PWM0_EXTCLK;                       /**< PWM0 external clock trigger connections, offset: 0x420 */
  __IO uint32_t PWM1_EXTCLK;                       /**< PWM1 external clock trigger connections, offset: 0x424 */
       uint8_t RESERVED_20[24];
  __IO uint32_t AOI0_IN[16];                       /**< AOI0 trigger inputs, array offset: 0x440, array step: 0x4 */
  __IO uint32_t AOI1_IN[16];                       /**< AOI1 trigger inputs, array offset: 0x480, array step: 0x4 */
  __IO uint32_t AOI_EXT_TRIG[8];                   /**< AOI External Trigger Inputs, array offset: 0x4C0, array step: 0x4 */
  __IO uint32_t HSCMP1_TRIG;                       /**< Input connections for HSCMP1, offset: 0x4E0 */
       uint8_t RESERVED_21[28];
  __IO uint32_t HSCMP2_TRIG;                       /**< Input connections for HSCMP2, offset: 0x500 */
       uint8_t RESERVED_22[28];
  __IO uint32_t DMA0_ITRIG_INMUX32[20];            /**< Trigger select for DMA0 channel, array offset: 0x520, array step: 0x4 */
       uint8_t RESERVED_23[464];
  __IO uint32_t DMA0_REQEN0;                       /**< Enable DMA0 requests, offset: 0x740 */
  __IO uint32_t DMA0_REQEN1;                       /**< Enable DMA0 requests, offset: 0x744 */
  __O  uint32_t DMA0_REQEN0_SET;                   /**< Set bits in DMA0_REQEN0 register, offset: 0x748 */
  __O  uint32_t DMA0_REQEN1_SET;                   /**< Set bits in DMA0_REQEN1 register, offset: 0x74C */
  __O  uint32_t DMA0_REQEN0_CLR;                   /**< Clear bits in DMA0_REQEN0 register, offset: 0x750 */
  __O  uint32_t DMA0_REQEN1_CLR;                   /**< Clear bits in DMA0_REQEN1 register, offset: 0x754 */
       uint8_t RESERVED_24[8];
  __IO uint32_t DMA1_REQEN;                        /**< Enable DMA1 requests, offset: 0x760 */
       uint8_t RESERVED_25[4];
  __O  uint32_t DMA1_REQEN_SET;                    /**< Set bits in DMA1_REQEN register, offset: 0x768 */
       uint8_t RESERVED_26[4];
  __O  uint32_t DMA1_REQEN_CLR;                    /**< Clear bits in DMA1_REQEN register, offset: 0x770 */
       uint8_t RESERVED_27[12];
  __IO uint32_t DMA0_ITRIGEN0;                     /**< Enable DMA0 triggers, offset: 0x780 */
  __IO uint32_t DMA0_ITRIGEN1;                     /**< Enable DMA0 triggers, offset: 0x784 */
  __O  uint32_t DMA0_ITRIGEN0_SET;                 /**< Set bits in DMA0_ITRIGEN0 register, offset: 0x788 */
  __O  uint32_t DMA0_ITRIGEN1_SET;                 /**< Set bits in DMA0_ITRIGEN1 register, offset: 0x78C */
  __O  uint32_t DMA0_ITRIGEN0_CLR;                 /**< Clear bits in DMA0_ITRIGEN0 register, offset: 0x790 */
  __O  uint32_t DMA0_ITRIGEN1_CLR;                 /**< Clear bits in DMA0_ITRIGEN1 register, offset: 0x794 */
       uint8_t RESERVED_28[8];
  __IO uint32_t DMA1_ITRIGEN;                      /**< Enable DMA1 triggers, offset: 0x7A0 */
       uint8_t RESERVED_29[4];
  __O  uint32_t DMA1_ITRIGEN_SET;                  /**< Set bits in DMA1_ITRIGEN register, offset: 0x7A8 */
       uint8_t RESERVED_30[4];
  __O  uint32_t DMA1_ITRIGEN_CLR;                  /**< Clear bits in DMA1_ITRIGEN register, offset: 0x7B0 */
} INPUTMUX_Type;

/* ----------------------------------------------------------------------------
   -- INPUTMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INPUTMUX_Register_Masks INPUTMUX Register Masks
 * @{
 */

/*! @name SCT0_INMUX - Inputmux register for SCT0 input */
/*! @{ */

#define INPUTMUX_SCT0_INMUX_INP_N_MASK           (0x3FU)
#define INPUTMUX_SCT0_INMUX_INP_N_SHIFT          (0U)
/*! INP_N - Input number to SCT0 inputs 0 to 6.
 *  0b000000..SCT_GPIO_IN_A function selected from IOCON register
 *  0b000001..SCT_GPIO_IN_B function selected from IOCON register
 *  0b000010..SCT_GPIO_IN_C function selected from IOCON register
 *  0b000011..SCT_GPIO_IN_D function selected from IOCON register
 *  0b000100..SCT_GPIO_IN_E function selected from IOCON register
 *  0b000101..SCT_GPIO_IN_F function selected from IOCON register
 *  0b000110..SCT_GPIO_IN_G function selected from IOCON register
 *  0b000111..SCT_GPIO_IN_H function selected from IOCON register
 *  0b001000..T0_MAT0 ctimer 0 match[0] output
 *  0b001001..T1_MAT0 ctimer 1 match[0] output
 *  0b001010..T2_MAT0 ctimer 2 match[0] output
 *  0b001011..T3_MAT0 ctimer 3 match[0] output
 *  0b001100..T4_MAT0 ctimer 4 match[0] output
 *  0b001101..ADC0_IRQ interrupt request from ADC0
 *  0b001110..GPIOINT_BMATCH
 *  0b001111..USB0_FRAME_TOGGLE
 *  0b010000..Reserved
 *  0b010001..ACMP0_OUT from analog comparator
 *  0b010010..SHARED_I2S_SCLK0 output from I2S pin sharing
 *  0b010011..SHARED_I2S_SCLK1 output from I2S pin sharing
 *  0b010100..SHARED_I2S_WS0 output from I2S pin sharing
 *  0b010101..SHARED_I2S_WS1 output from I2S pin sharing
 *  0b010110..ARM_TXEV interrupt event from CPU0
 *  0b010111..DEBUG_HALTED from CPU0
 *  0b011000..ADC1_IRQ interrupt request from ADC1
 *  0b011001..ADC0_tcomp[0]
 *  0b011010..ADC0_tcomp[1]
 *  0b011011..ADC0_tcomp[2]
 *  0b011100..ADC0_tcomp[3]
 *  0b011101..ADC1_tcomp[0]
 *  0b011110..ADC1_tcomp[1]
 *  0b011111..ADC1_tcomp[2]
 *  0b100000..ADC1_tcomp[3]
 *  0b100001..HSCMP0_OUT
 *  0b100010..HSCMP1_OUT
 *  0b100011..HSCMP2_OUT
 *  0b100100..PWM0_SM0_MUX_TRIG0 | PWM0_SM0_MUX_TRIG1
 *  0b100101..PWM0_SM1_MUX_TRIG0 | PWM0_SM1_MUX_TRIG1
 *  0b100110..PWM0_SM2_MUX_TRIG0 | PWM0_SM2_MUX_TRIG1
 *  0b100111..PWM0_SM3_MUX_TRIG0 | PWM0_SM3_MUX_TRIG1
 *  0b101000..PWM1_SM0_MUX_TRIG0 | PWM1_SM0_MUX_TRIG1
 *  0b101001..PWM1_SM1_MUX_TRIG0 | PWM1_SM1_MUX_TRIG1
 *  0b101010..PWM1_SM2_MUX_TRIG0 | PWM1_SM2_MUX_TRIG1
 *  0b101011..PWM1_SM3_MUX_TRIG0 | PWM1_SM3_MUX_TRIG1
 *  0b101100..ENC0_CMP/POS_MATCH
 *  0b101101..ENC1_CMP/POS_MATCH
 *  0b101110..AOI0_OUT0
 *  0b101111..AOI0_OUT1
 *  0b110000..AOI0_OUT2
 *  0b110001..AOI0_OUT3
 *  0b110010..AOI1_OUT0
 *  0b110011..AOI1_OUT1
 *  0b110100..AOI1_OUT2
 *  0b110101..AOI1_OUT3
 *  0b110110..FC3_SCK
 *  0b110111..FC3_RXD_SDA_MOSI_DATA
 *  0b111000..FC3_TXD_SCL_MISO_WS
 *  0b111001..FC3_CTS_DSA_SSEL0
 *  0b111010..TMPR_OUT
 *  0b111011-0b111111..None
 */
#define INPUTMUX_SCT0_INMUX_INP_N(x)             (((uint32_t)(((uint32_t)(x)) << INPUTMUX_SCT0_INMUX_INP_N_SHIFT)) & INPUTMUX_SCT0_INMUX_INP_N_MASK)
/*! @} */

