nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
/*! @name EZHARCHB_INMUX - Inputmux register for EZH arch B inputs */
/*! @{ */

#define INPUTMUX_EZHARCHB_INMUX_INP_MASK         (0x7FU)
#define INPUTMUX_EZHARCHB_INMUX_INP_SHIFT        (0U)
/*! INP - Input number select to EZHARCHB input
 *  0b0000000-0b0001111..GPI00_0 to GPIO0_15 functions synced to system clock, selected from IOCON register
 *  0b0010000..SCT_OUT8 output from SCTimer, synced to system clock
 *  0b0010001..SCT_OUT9 output from SCTimer, synced to system clock
 *  0b0010010..Reserved
 *  0b0010011..Reserved
 *  0b0010100..MRT_IRQ0 Multi-rate timer interrupt request 0
 *  0b0010101..MRT_IRQ1 Multi-rate timer interrupt request 1
 *  0b0010110..T4_MAT3 ctimer 4 match[3] output
 *  0b0010111..T4_MAT2 ctimer 4 match[2] output
 *  0b0011000..T3_MAT3 ctimer 3 match[3] output
 *  0b0011001..T3_MAT2 ctimer 3 match[2] output
 *  0b0011010..T1_MAT3 ctimer 1 match[3] output
 *  0b0011011..T1_MAT2 ctimer 1 match[2] output
 *  0b0011100..UTICK0_IRQ Micro-tick timer interrupt, synced to system clock
 *  0b0011101..WDT_IRQ Watchdog Timer interrupt request, synced to system clock
 *  0b0011110..ADC0_IRQ interrupt request from ADC
 *  0b0011111..ACMP0_IRQ Combined Analog comparator interrupt request
 *  0b0100000..LSPI_HS_IRQ High speed Serial Peripheral interface interrupt request
 *  0b0100001..FLEXCOMM7_IRQ Flexcomm7 interrupt synced to system clock
 *  0b0100010..FLEXCOMM6_IRQ Flexcomm6 interrupt synced to system clock
 *  0b0100011..FLEXCOMM5_IRQ Flexcomm5 interrupt synced to system clock
 *  0b0100100..FLEXCOMM4_IRQ Flexcomm4 interrupt synced to system clock
 *  0b0100101..FLEXCOMM3_IRQ Flexcomm3 interrupt synced to system clock
 *  0b0100110..FLEXCOMM2_IRQ Flexcomm2 interrupt synced to system clock
 *  0b0100111..FLEXCOMM1_IRQ Flexcomm1 interrupt synced to system clock
 *  0b0101000..FLEXCOMM0_IRQ Flexcomm0 interrupt synced to system clock
 *  0b0101001..DMA0_IRQ DMA0 interrupt request
 *  0b0101010..DMA1_IRQ DMA1 interrupt request
 *  0b0101011..SYS_IRQ combined WDT_INT Watchdog Timer interrupt request | FLASH_IRQ Flash interrupt request | BOD_IRQ BrownOut Detection interrupt request
 *  0b0101100..RTC_COMBO_IRQ Real Time Clock Combined Alarm | Wake-up interrupt request
 *  0b0101101..ARM_TXEV interrupt event from CPU0
 *  0b0101110..GPIOINT_BMATCH GPIO_INT boolean pattern match output
 *  0b0101111..Reserved
 *  0b0110000..Reserved
 *  0b0110001..ACMP_OUT output from analog comparator
 *  0b0110010..USB0_FRAME_TOGGLE
 *  0b0110011..Reserved
 *  0b0110100..OSTIMER_IRQ OS Timer interrupt request
 *  0b0110101..ADC1 interrupt
 *  0b0110110..HSCOMP0_IRQ/HSCOMP1_IRQ/HSCOMP2_IRQ
 *  0b0110111..DAC0 interrupt
 *  0b0111000..DAC1/2 interrupt
 *  0b0111001..FlexPWM0 interrupt
 *  0b0111010..FlexPWM1 interrupt
 *  0b0111011..ENC0 interrupt
 *  0b0111100..ENC1 interrupt
 *  0b0111101..AOI0_OUT0
 *  0b0111110..AOI1_OUT0
 *  0b0111111..TMPR_OUT
 *  0b1000000-0b1111110..Reserved
 */
#define INPUTMUX_EZHARCHB_INMUX_INP(x)           (((uint32_t)(((uint32_t)(x)) << INPUTMUX_EZHARCHB_INMUX_INP_SHIFT)) & INPUTMUX_EZHARCHB_INMUX_INP_MASK)
/*! @} */

/* The count of INPUTMUX_EZHARCHB_INMUX */
#define INPUTMUX_EZHARCHB_INMUX_COUNT            (8U)

/*! @name PINTSEL - Pin interrupt select */
/*! @{ */

#define INPUTMUX_PINTSEL_INTPIN_MASK             (0x7FU)
#define INPUTMUX_PINTSEL_INTPIN_SHIFT            (0U)
/*! INTPIN - Pin number select for pin interrupt or pattern match engine input. For PIOx_y: INTPIN =
 *    (x * 32) + y. PIO0_0 to PIO1_31 correspond to numbers 0 to 63.
 */
#define INPUTMUX_PINTSEL_INTPIN(x)               (((uint32_t)(((uint32_t)(x)) << INPUTMUX_PINTSEL_INTPIN_SHIFT)) & INPUTMUX_PINTSEL_INTPIN_MASK)
/*! @} */

/* The count of INPUTMUX_PINTSEL */
#define INPUTMUX_PINTSEL_COUNT                   (8U)

/*! @name DMA0_ITRIG_INMUX - Trigger select for DMA0 channel */
/*! @{ */

#define INPUTMUX_DMA0_ITRIG_INMUX_INP_MASK       (0x3FU)
#define INPUTMUX_DMA0_ITRIG_INMUX_INP_SHIFT      (0U)
/*! INP - Trigger input number (binary value) for DMA channel n (n = 0 to 31).
 *  0b000000..FlexSPI_RX
 *  0b000001..FlexSPI_TX
 *  0b000010..GPIO_INT0
 *  0b000011..GPIO_INT1
 *  0b000100..GPIO_INT2
 *  0b000101..GPIO_INT3
 *  0b000110..T0_DMAREQ_M0
 *  0b000111..T0_DMAREQ_M1
 *  0b001000..T1_DMAREQ_M0
 *  0b001001..T1_DMAREQ_M1
 *  0b001010..T2_DMAREQ_M0
 *  0b001011..T2_DMAREQ_M1
 *  0b001100..T3_DMAREQ_M0
 *  0b001101..T3_DMAREQ_M1
 *  0b001110..T4_DMAREQ_M0
 *  0b001111..T4_DMAREQ_M1
 *  0b010000..ACMP0_OUT
 *  0b010001..SDMA0_TRIGOUT_A
 *  0b010010..SDMA0_TRIGOUT_B
 *  0b010011..SDMA0_TRIGOUT_C
 *  0b010100..SDMA0_TRIGOUT_D
 *  0b010101..SCT_DMA0
 *  0b010110..SCT_DMA1
 *  0b010111..ADC0_tcomp[0]
 *  0b011000..ADC1_tcomp[0]
 *  0b011001..HSCMP0
 *  0b011010..HSCMP1
 *  0b011011..HSCMP2
 *  0b011100..AOI0_OUT0
 *  0b011101..AOI0_OUT1
 *  0b011110..AOI0_OUT2
 *  0b011111..AOI0_OUT3
 *  0b100000..AOI1_OUT0
 *  0b100001..AOI1_OUT1
 *  0b100010..AOI1_OUT2
 *  0b100011..AOI1_OUT3
 *  0b100100..FlexPWM0_req_capt0
 *  0b100101..FlexPWM0_req_capt1
 *  0b100110..FlexPWM0_req_capt2
 *  0b100111..FlexPWM0_req_capt3
 *  0b101000..FlexPWM0_req_val0
 *  0b101001..FlexPWM0_req_val1
 *  0b101010..FlexPWM0_req_val2
 *  0b101011..FlexPWM0_req_val3
 *  0b101100..FlexPWM1_req_capt0
 *  0b101101..FlexPWM1_req_capt1
 *  0b101110..FlexPWM1_req_capt2
 *  0b101111..FlexPWM1_req_capt3
 *  0b110000..FlexPWM1_req_val0
 *  0b110001..FlexPWM1_req_val1
 *  0b110010..FlexPWM1_req_val2
 *  0b110011..FlexPWM1_req_val3
 *  0b110100..TMPR_OUT
 *  0b110110-0b111111..Reserved
 */
#define INPUTMUX_DMA0_ITRIG_INMUX_INP(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIG_INMUX_INP_SHIFT)) & INPUTMUX_DMA0_ITRIG_INMUX_INP_MASK)
/*! @} */

/* The count of INPUTMUX_DMA0_ITRIG_INMUX */
#define INPUTMUX_DMA0_ITRIG_INMUX_COUNT          (32U)

/*! @name DMA0_OTRIG_INMUX - DMA0 output trigger selection for DMA0 input trigger */
/*! @{ */

#define INPUTMUX_DMA0_OTRIG_INMUX_INP_MASK       (0x3FU)
#define INPUTMUX_DMA0_OTRIG_INMUX_INP_SHIFT      (0U)
/*! INP - DMA trigger output number (binary value) for DMA channel n (n = 0 to 52).
 */
#define INPUTMUX_DMA0_OTRIG_INMUX_INP(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_OTRIG_INMUX_INP_SHIFT)) & INPUTMUX_DMA0_OTRIG_INMUX_INP_MASK)
/*! @} */

