nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
/* The count of INPUTMUX_DMA0_OTRIG_INMUX */
#define INPUTMUX_DMA0_OTRIG_INMUX_COUNT          (7U)

/*! @name FREQMEAS_REF - Selection for frequency measurement reference clock */
/*! @{ */

#define INPUTMUX_FREQMEAS_REF_CLKIN_MASK         (0x1FU)
#define INPUTMUX_FREQMEAS_REF_CLKIN_SHIFT        (0U)
/*! CLKIN - Clock source number (binary value) for frequency measure function target clock.
 *  0b00000..XTAL32MHz
 *  0b00001..FRO_OSC_12M
 *  0b00010..FRO_OSC_96M
 *  0b00011..WDOSC (FRO1M)
 *  0b00100..32KHZ_OSC
 *  0b00101..MAIN_SYS_CLOCK
 *  0b00110..FREQME_GPIO_CLK_A
 *  0b00111..FREQME_GPIO_CLK_B
 *  0b01000..AOI0_OUT2
 *  0b01001..AOI1_OUT2
 */
#define INPUTMUX_FREQMEAS_REF_CLKIN(x)           (((uint32_t)(((uint32_t)(x)) << INPUTMUX_FREQMEAS_REF_CLKIN_SHIFT)) & INPUTMUX_FREQMEAS_REF_CLKIN_MASK)
/*! @} */

/*! @name FREQMEAS_TAR - Selection for frequency measurement target clock */
/*! @{ */

#define INPUTMUX_FREQMEAS_TAR_CLKIN_MASK         (0x1FU)
#define INPUTMUX_FREQMEAS_TAR_CLKIN_SHIFT        (0U)
/*! CLKIN - Clock source number (binary value) for frequency measure function target clock
 *  0b00000..XTAL32MHz
 *  0b00001..FRO_OSC_12M
 *  0b00010..FRO_OSC_96M
 *  0b00011..WDOSC (FRO1M)
 *  0b00100..32KHZ_OSC
 *  0b00101..MAIN_SYS_CLOCK
 *  0b00110..FREQME_GPIO_CLK_A
 *  0b00111..FREQME_GPIO_CLK_B
 *  0b01000..AOI0_OUT2
 *  0b01001..AOI1_OUT2
 */
#define INPUTMUX_FREQMEAS_TAR_CLKIN(x)           (((uint32_t)(((uint32_t)(x)) << INPUTMUX_FREQMEAS_TAR_CLKIN_SHIFT)) & INPUTMUX_FREQMEAS_TAR_CLKIN_MASK)
/*! @} */

/*! @name TIMER3CAP - Capture select register for TIMER3 inputs */
/*! @{ */

#define INPUTMUX_TIMER3CAP_CAPTSEL_MASK          (0x3FU)
#define INPUTMUX_TIMER3CAP_CAPTSEL_SHIFT         (0U)
/*! CAPTSEL - Input number to TIMER3 capture inputs 0 to 5
 *  0b000000..CTIMER_INP0 function selected from IOCON register
 *  0b000001..CTIMER_INP1 function selected from IOCON register
 *  0b000010..CTIMER_INP2 function selected from IOCON register
 *  0b000011..CTIMER_INP3 function selected from IOCON register
 *  0b000100..CTIMER_INP4 function selected from IOCON register
 *  0b000101..CTIMER_INP5 function selected from IOCON register
 *  0b000110..CTIMER_INP6 function selected from IOCON register
 *  0b000111..CTIMER_INP7 function selected from IOCON register
 *  0b001000..CTIMER_INP8 function selected from IOCON register
 *  0b001001..CTIMER_INP9 function selected from IOCON register
 *  0b001010..CTIMER_INP10 function selected from IOCON register
 *  0b001011..CTIMER_INP11 function selected from IOCON register
 *  0b001100..CTIMER_INP12 function selected from IOCON register
 *  0b001101..CTIMER_INP13 function selected from IOCON register
 *  0b001110..CTIMER_INP14 function selected from IOCON register
 *  0b001111..CTIMER_INP15 function selected from IOCON register
 *  0b010000..CTIMER_INP16 function selected from IOCON register
 *  0b010001..CTIMER_INP17 function selected from IOCON register
 *  0b010010..CTIMER_INP18 function selected from IOCON register
 *  0b010011..CTIMER_INP19 function selected from IOCON register
 *  0b010100..USB0_FRAME_TOGGLE
 *  0b010101..Reserved
 *  0b010110..ACMP0_OUT from analog comparator
 *  0b010111..SHARED_I2S_WS0 output from I2S pin sharing
 *  0b011000..SHARED_I2S_WS1 output from I2S pin sharing
 *  0b011001..ADC0_IRQ
 *  0b011010..ADC1_IRQ
 *  0b011011..HSCMP0_OUT
 *  0b011100..HSCMP1_OUT
 *  0b011101..HSCMP2_OUT
 *  0b011110..PWM0_SM0_MUX_TRIG0 | PWM0_SM0_MUX_TRIG1
 *  0b011111..PWM0_SM1_MUX_TRIG0 | PWM0_SM1_MUX_TRIG1
 *  0b100000..PWM0_SM2_MUX_TRIG0 | PWM0_SM2_MUX_TRIG1
 *  0b100001..PWM0_SM3_MUX_TRIG0 | PWM0_SM3_MUX_TRIG1
 *  0b100010..PWM1_SM0_MUX_TRIG0 | PWM1_SM0_MUX_TRIG1
 *  0b100011..PWM1_SM1_MUX_TRIG0 | PWM1_SM1_MUX_TRIG1
 *  0b100100..PWM1_SM2_MUX_TRIG0 | PWM1_SM2_MUX_TRIG1
 *  0b100101..PWM1_SM3_MUX_TRIG0 | PWM1_SM3_MUX_TRIG1
 *  0b100110..ENC0_CMP/POS_MATCH
 *  0b100111..ENC1_CMP/POS_MATCH
 *  0b101000..AOI0_OUT0
 *  0b101001..AOI0_OUT1
 *  0b101010..AOI0_OUT2
 *  0b101011..AOI0_OUT3
 *  0b101100..AOI1_OUT0
 *  0b101101..AOI1_OUT1
 *  0b101110..AOI1_OUT2
 *  0b101111..AOI1_OUT3
 *  0b110000..TMPR_OUT
 *  0b110001-0b111111..None
 */
#define INPUTMUX_TIMER3CAP_CAPTSEL(x)            (((uint32_t)(((uint32_t)(x)) << INPUTMUX_TIMER3CAP_CAPTSEL_SHIFT)) & INPUTMUX_TIMER3CAP_CAPTSEL_MASK)
/*! @} */

/* The count of INPUTMUX_TIMER3CAP */
#define INPUTMUX_TIMER3CAP_COUNT                 (4U)

/*! @name TIMER3TRIG - Trigger register for TIMER3 */
/*! @{ */

#define INPUTMUX_TIMER3TRIG_TRIGIN_MASK          (0x3FU)
#define INPUTMUX_TIMER3TRIG_TRIGIN_SHIFT         (0U)
/*! TRIGIN - Input number to TIMER3 trigger inputs
 *  0b000000..CTIMER_INP0 function selected from IOCON register
 *  0b000001..CTIMER_INP1 function selected from IOCON register
 *  0b000010..CTIMER_INP2 function selected from IOCON register
 *  0b000011..CTIMER_INP3 function selected from IOCON register
 *  0b000100..CTIMER_INP4 function selected from IOCON register
 *  0b000101..CTIMER_INP5 function selected from IOCON register
 *  0b000110..CTIMER_INP6 function selected from IOCON register
 *  0b000111..CTIMER_INP7 function selected from IOCON register
 *  0b001000..CTIMER_INP8 function selected from IOCON register
 *  0b001001..CTIMER_INP9 function selected from IOCON register
 *  0b001010..CTIMER_INP10 function selected from IOCON register
 *  0b001011..CTIMER_INP11 function selected from IOCON register
 *  0b001100..CTIMER_INP12 function selected from IOCON register
 *  0b001101..CTIMER_INP13 function selected from IOCON register
 *  0b001110..CTIMER_INP14 function selected from IOCON register
 *  0b001111..CTIMER_INP15 function selected from IOCON register
 *  0b010000..CTIMER_INP16 function selected from IOCON register
 *  0b010001..CTIMER_INP17 function selected from IOCON register
 *  0b010010..CTIMER_INP18 function selected from IOCON register
 *  0b010011..CTIMER_INP19 function selected from IOCON register
 *  0b010100..USB0_FRAME_TOGGLE
 *  0b010101..Reserved
 *  0b010110..ACMP0_OUT from analog comparator
 *  0b010111..SHARED_I2S_WS0 output from I2S pin sharing
 *  0b011000..SHARED_I2S_WS1 output from I2S pin sharing
 *  0b011001..ADC0_IRQ
 *  0b011010..ADC1_IRQ
 *  0b011011..HSCMP0_OUT
 *  0b011100..HSCMP1_OUT
 *  0b011101..HSCMP2_OUT
 *  0b011110..PWM0_SM0_MUX_TRIG0 | PWM0_SM0_MUX_TRIG1
 *  0b011111..PWM0_SM1_MUX_TRIG0 | PWM0_SM1_MUX_TRIG1
 *  0b100000..PWM0_SM2_MUX_TRIG0 | PWM0_SM2_MUX_TRIG1
 *  0b100001..PWM0_SM3_MUX_TRIG0 | PWM0_SM3_MUX_TRIG1
 *  0b100010..PWM1_SM0_MUX_TRIG0 | PWM1_SM0_MUX_TRIG1
 *  0b100011..PWM1_SM1_MUX_TRIG0 | PWM1_SM1_MUX_TRIG1
 *  0b100100..PWM1_SM2_MUX_TRIG0 | PWM1_SM2_MUX_TRIG1
 *  0b100101..PWM1_SM3_MUX_TRIG0 | PWM1_SM3_MUX_TRIG1
 *  0b100110..ENC0_CMP/POS_MATCH
 *  0b100111..ENC1_CMP/POS_MATCH
 *  0b101000..AOI0_OUT0
 *  0b101001..AOI0_OUT1
 *  0b101010..AOI0_OUT2
 *  0b101011..AOI0_OUT3
 *  0b101100..AOI1_OUT0
 *  0b101101..AOI1_OUT1
 *  0b101110..AOI1_OUT2
 *  0b101111..AOI1_OUT3
 *  0b110000..TMPR_OUT
 *  0b110001-0b111111..None
 */
#define INPUTMUX_TIMER3TRIG_TRIGIN(x)            (((uint32_t)(((uint32_t)(x)) << INPUTMUX_TIMER3TRIG_TRIGIN_SHIFT)) & INPUTMUX_TIMER3TRIG_TRIGIN_MASK)
/*! @} */

/*! @name TIMER4CAP - Capture select register for TIMER4 inputs */
/*! @{ */

