nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
/*! @name PWM1_EXTAN_PWM1_EXTA - PWM1 input trigger connections */
/*! @{ */

#define INPUTMUX_PWM1_EXTAN_PWM1_EXTA_TRIGIN_MASK (0x3FU)
#define INPUTMUX_PWM1_EXTAN_PWM1_EXTA_TRIGIN_SHIFT (0U)
/*! TRIGIN - Trigger input connections for PWM1
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT2
 *  0b000010..SCT_OUT4
 *  0b000011..SCT_OUT5
 *  0b000100..SCT_OUT3
 *  0b000101..T0_MAT3
 *  0b000110..T1_MAT3
 *  0b000111..T2_MAT3
 *  0b001000..T2_MAT1
 *  0b001001..T4_MAT1
 *  0b001010..ACMP0_OUT
 *  0b001011..ARM_TXEV
 *  0b001100..GPIOINT_BMATCH
 *  0b001101..ADC0_tcomp[0]
 *  0b001110..ADC0_tcomp[1]
 *  0b001111..ADC0_tcomp[2]
 *  0b010000..ADC0_tcomp[3]
 *  0b010001..ADC1_tcomp[0]
 *  0b010010..ADC1_tcomp[1]
 *  0b010011..ADC1_tcomp[2]
 *  0b010100..ADC1_tcomp[3]
 *  0b010101..HSCMP0_OUT
 *  0b010110..HSCMP1_OUT
 *  0b010111..HSCMP2_OUT
 *  0b011000..PWM0_SM0_MUX_TRIG0
 *  0b011001..PWM0_SM0_MUX_TRIG1
 *  0b011010..PWM0_SM1_MUX_TRIG0
 *  0b011011..PWM0_SM1_MUX_TRIG1
 *  0b011100..PWM0_SM2_MUX_TRIG0
 *  0b011101..PWM0_SM2_MUX_TRIG1
 *  0b011110..PWM0_SM3_MUX_TRIG0
 *  0b011111..PWM0_SM3_MUX_TRIG1
 *  0b100000..ENC0_CMP/POS_MATCH
 *  0b100001..ENC1_CMP/POS_MATCH
 *  0b100010..AOI0_OUT0
 *  0b100011..AOI0_OUT1
 *  0b100100..AOI0_OUT2
 *  0b100101..AOI0_OUT3
 *  0b100110..AOI1_OUT0
 *  0b100111..AOI1_OUT1
 *  0b101000..AOI1_OUT2
 *  0b101001..AOI1_OUT3
 *  0b101010..EXTTRIG_IN0
 *  0b101011..EXTTRIG_IN1
 *  0b101100..EXTTRIG_IN2
 *  0b101101..EXTTRIG_IN3
 *  0b101110..EXTTRIG_IN4
 *  0b101111..EXTTRIG_IN5
 *  0b110000..EXTTRIG_IN6
 *  0b110001..EXTTRIG_IN7
 *  0b110010..EXTTRIG_IN8
 *  0b110011..EXTTRIG_IN9
 *  0b110100..DMA0_TRIGOUT0
 *  0b110101..DMA0_TRIGOUT1
 *  0b110110..DMA0_TRIGOUT2
 */
#define INPUTMUX_PWM1_EXTAN_PWM1_EXTA_TRIGIN(x)  (((uint32_t)(((uint32_t)(x)) << INPUTMUX_PWM1_EXTAN_PWM1_EXTA_TRIGIN_SHIFT)) & INPUTMUX_PWM1_EXTAN_PWM1_EXTA_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX_PWM1_EXTAN_PWM1_EXTA */
#define INPUTMUX_PWM1_EXTAN_PWM1_EXTA_COUNT      (4U)

/*! @name PWM1_EXTFORCE - PWM1 external force trigger connections */
/*! @{ */

#define INPUTMUX_PWM1_EXTFORCE_TRIGIN_MASK       (0x3FU)
#define INPUTMUX_PWM1_EXTFORCE_TRIGIN_SHIFT      (0U)
/*! TRIGIN - Trigger input connections for PWM1
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT2
 *  0b000010..SCT_OUT4
 *  0b000011..SCT_OUT5
 *  0b000100..SCT_OUT3
 *  0b000101..T0_MAT3
 *  0b000110..T1_MAT3
 *  0b000111..T2_MAT3
 *  0b001000..T2_MAT1
 *  0b001001..T4_MAT1
 *  0b001010..ACMP0_OUT
 *  0b001011..ARM_TXEV
 *  0b001100..GPIOINT_BMATCH
 *  0b001101..ADC0_tcomp[0]
 *  0b001110..ADC0_tcomp[1]
 *  0b001111..ADC0_tcomp[2]
 *  0b010000..ADC0_tcomp[3]
 *  0b010001..ADC1_tcomp[0]
 *  0b010010..ADC1_tcomp[1]
 *  0b010011..ADC1_tcomp[2]
 *  0b010100..ADC1_tcomp[3]
 *  0b010101..HSCMP0_OUT
 *  0b010110..HSCMP1_OUT
 *  0b010111..HSCMP2_OUT
 *  0b011000..PWM0_SM0_MUX_TRIG0
 *  0b011001..PWM0_SM0_MUX_TRIG1
 *  0b011010..PWM0_SM1_MUX_TRIG0
 *  0b011011..PWM0_SM1_MUX_TRIG1
 *  0b011100..PWM0_SM2_MUX_TRIG0
 *  0b011101..PWM0_SM2_MUX_TRIG1
 *  0b011110..PWM0_SM3_MUX_TRIG0
 *  0b011111..PWM0_SM3_MUX_TRIG1
 *  0b100000..ENC0_CMP/POS_MATCH
 *  0b100001..ENC1_CMP/POS_MATCH
 *  0b100010..AOI0_OUT0
 *  0b100011..AOI0_OUT1
 *  0b100100..AOI0_OUT2
 *  0b100101..AOI0_OUT3
 *  0b100110..AOI1_OUT0
 *  0b100111..AOI1_OUT1
 *  0b101000..AOI1_OUT2
 *  0b101001..AOI1_OUT3
 *  0b101010..EXTTRIG_IN0
 *  0b101011..EXTTRIG_IN1
 *  0b101100..EXTTRIG_IN2
 *  0b101101..EXTTRIG_IN3
 *  0b101110..EXTTRIG_IN4
 *  0b101111..EXTTRIG_IN5
 *  0b110000..EXTTRIG_IN6
 *  0b110001..EXTTRIG_IN7
 *  0b110010..EXTTRIG_IN8
 *  0b110011..EXTTRIG_IN9
 *  0b110100..DMA0_TRIGOUT0
 *  0b110101..DMA0_TRIGOUT1
 *  0b110110..DMA0_TRIGOUT2
 */
#define INPUTMUX_PWM1_EXTFORCE_TRIGIN(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_PWM1_EXTFORCE_TRIGIN_SHIFT)) & INPUTMUX_PWM1_EXTFORCE_TRIGIN_MASK)
/*! @} */

/*! @name PWM1_FAULTN_PWM1_FAULT - PWM1 fault input trigger connections */
/*! @{ */

#define INPUTMUX_PWM1_FAULTN_PWM1_FAULT_TRIGIN_MASK (0x3FU)
#define INPUTMUX_PWM1_FAULTN_PWM1_FAULT_TRIGIN_SHIFT (0U)
/*! TRIGIN - Trigger input connections for PWM1
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT2
 *  0b000010..SCT_OUT4
 *  0b000011..SCT_OUT5
 *  0b000100..SCT_OUT3
 *  0b000101..T0_MAT3
 *  0b000110..T1_MAT3
 *  0b000111..T2_MAT3
 *  0b001000..T2_MAT1
 *  0b001001..T4_MAT1
 *  0b001010..ACMP0_OUT
 *  0b001011..ARM_TXEV
 *  0b001100..GPIOINT_BMATCH
 *  0b001101..ADC0_tcomp[0]
 *  0b001110..ADC0_tcomp[1]
 *  0b001111..ADC0_tcomp[2]
 *  0b010000..ADC0_tcomp[3]
 *  0b010001..ADC1_tcomp[0]
 *  0b010010..ADC1_tcomp[1]
 *  0b010011..ADC1_tcomp[2]
 *  0b010100..ADC1_tcomp[3]
 *  0b010101..HSCMP0_OUT
 *  0b010110..HSCMP1_OUT
 *  0b010111..HSCMP2_OUT
 *  0b011000..PWM0_SM0_MUX_TRIG0
 *  0b011001..PWM0_SM0_MUX_TRIG1
 *  0b011010..PWM0_SM1_MUX_TRIG0
 *  0b011011..PWM0_SM1_MUX_TRIG1
 *  0b011100..PWM0_SM2_MUX_TRIG0
 *  0b011101..PWM0_SM2_MUX_TRIG1
 *  0b011110..PWM0_SM3_MUX_TRIG0
 *  0b011111..PWM0_SM3_MUX_TRIG1
 *  0b100000..ENC0_CMP/POS_MATCH
 *  0b100001..ENC1_CMP/POS_MATCH
 *  0b100010..AOI0_OUT0
 *  0b100011..AOI0_OUT1
 *  0b100100..AOI0_OUT2
 *  0b100101..AOI0_OUT3
 *  0b100110..AOI1_OUT0
 *  0b100111..AOI1_OUT1
 *  0b101000..AOI1_OUT2
 *  0b101001..AOI1_OUT3
 *  0b101010..EXTTRIG_IN0
 *  0b101011..EXTTRIG_IN1
 *  0b101100..EXTTRIG_IN2
 *  0b101101..EXTTRIG_IN3
 *  0b101110..EXTTRIG_IN4
 *  0b101111..EXTTRIG_IN5
 *  0b110000..EXTTRIG_IN6
 *  0b110001..EXTTRIG_IN7
 *  0b110010..EXTTRIG_IN8
 *  0b110011..EXTTRIG_IN9
 *  0b110100..DMA0_TRIGOUT0
 *  0b110101..DMA0_TRIGOUT1
 *  0b110110..DMA0_TRIGOUT2
 */
#define INPUTMUX_PWM1_FAULTN_PWM1_FAULT_TRIGIN(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_PWM1_FAULTN_PWM1_FAULT_TRIGIN_SHIFT)) & INPUTMUX_PWM1_FAULTN_PWM1_FAULT_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX_PWM1_FAULTN_PWM1_FAULT */
#define INPUTMUX_PWM1_FAULTN_PWM1_FAULT_COUNT    (4U)

/*! @name PWM0_EXTCLK - PWM0 external clock trigger connections */
/*! @{ */

#define INPUTMUX_PWM0_EXTCLK_TRIGIN_MASK         (0x3FU)
#define INPUTMUX_PWM0_EXTCLK_TRIGIN_SHIFT        (0U)
/*! TRIGIN - Trigger input connections for PWM0
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT5
 *  0b000010..SCT_OUT4
 *  0b000011..SCT_OUT5
 *  0b000100..SCT_OUT2
 *  0b000101..T0_MAT3
 *  0b000110..T1_MAT3
 *  0b000111..T2_MAT3
 *  0b001000..T2_MAT0
 *  0b001001..T4_MAT0
 *  0b001010..ACMP0_OUT
 *  0b001011..ARM_TXEV
 *  0b001100..GPIOINT_BMATCH
 *  0b001101..ADC0_tcomp[0]
 *  0b001110..ADC0_tcomp[1]
 *  0b001111..ADC0_tcomp[2]
 *  0b010000..ADC0_tcomp[3]
 *  0b010001..ADC1_tcomp[0]
 *  0b010010..ADC1_tcomp[1]
 *  0b010011..ADC1_tcomp[2]
 *  0b010100..ADC1_tcomp[3]
 *  0b010101..HSCMP0_OUT
 *  0b010110..HSCMP1_OUT
 *  0b010111..HSCMP2_OUT
 *  0b011000..PWM1_SM0_MUX_TRIG0
 *  0b011001..PWM1_SM0_MUX_TRIG1
 *  0b011010..PWM1_SM1_MUX_TRIG0
 *  0b011011..PWM1_SM1_MUX_TRIG1
 *  0b011100..PWM1_SM2_MUX_TRIG0
 *  0b011101..PWM1_SM2_MUX_TRIG1
 *  0b011110..PWM1_SM3_MUX_TRIG0
 *  0b011111..PWM1_SM3_MUX_TRIG1
 *  0b100000..ENC0_CMP/POS_MATCH
 *  0b100001..ENC1_CMP/POS_MATCH
 *  0b100010..AOI0_OUT0
 *  0b100011..AOI0_OUT1
 *  0b100100..AOI0_OUT2
 *  0b100101..AOI0_OUT3
 *  0b100110..AOI1_OUT0
 *  0b100111..AOI1_OUT1
 *  0b101000..AOI1_OUT2
 *  0b101001..AOI1_OUT3
 *  0b101010..EXTTRIG_IN0
 *  0b101011..EXTTRIG_IN1
 *  0b101100..EXTTRIG_IN2
 *  0b101101..EXTTRIG_IN3
 *  0b101110..EXTTRIG_IN4
 *  0b101111..EXTTRIG_IN5
 *  0b110000..EXTTRIG_IN6
 *  0b110001..EXTTRIG_IN7
 *  0b110010..EXTTRIG_IN8
 *  0b110011..EXTTRIG_IN9
 *  0b110100..DMA0_TRIGOUT0
 *  0b110101..DMA0_TRIGOUT1
 *  0b110110..DMA0_TRIGOUT2
 */
#define INPUTMUX_PWM0_EXTCLK_TRIGIN(x)           (((uint32_t)(((uint32_t)(x)) << INPUTMUX_PWM0_EXTCLK_TRIGIN_SHIFT)) & INPUTMUX_PWM0_EXTCLK_TRIGIN_MASK)
/*! @} */

/*! @name PWM1_EXTCLK - PWM1 external clock trigger connections */
/*! @{ */

#define INPUTMUX_PWM1_EXTCLK_TRIGIN_MASK         (0x3FU)
#define INPUTMUX_PWM1_EXTCLK_TRIGIN_SHIFT        (0U)
/*! TRIGIN - Trigger input connections for PWM1
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT2
 *  0b000010..SCT_OUT4
 *  0b000011..SCT_OUT5
 *  0b000100..SCT_OUT3
 *  0b000101..T0_MAT3
 *  0b000110..T1_MAT3
 *  0b000111..T2_MAT3
 *  0b001000..T2_MAT1
 *  0b001001..T4_MAT1
 *  0b001010..ACMP0_OUT
 *  0b001011..ARM_TXEV
 *  0b001100..GPIOINT_BMATCH
 *  0b001101..ADC0_tcomp[0]
 *  0b001110..ADC0_tcomp[1]
 *  0b001111..ADC0_tcomp[2]
 *  0b010000..ADC0_tcomp[3]
 *  0b010001..ADC1_tcomp[0]
 *  0b010010..ADC1_tcomp[1]
 *  0b010011..ADC1_tcomp[2]
 *  0b010100..ADC1_tcomp[3]
 *  0b010101..HSCMP0_OUT
 *  0b010110..HSCMP1_OUT
 *  0b010111..HSCMP2_OUT
 *  0b011000..PWM0_SM0_MUX_TRIG0
 *  0b011001..PWM0_SM0_MUX_TRIG1
 *  0b011010..PWM0_SM1_MUX_TRIG0
 *  0b011011..PWM0_SM1_MUX_TRIG1
 *  0b011100..PWM0_SM2_MUX_TRIG0
 *  0b011101..PWM0_SM2_MUX_TRIG1
 *  0b011110..PWM0_SM3_MUX_TRIG0
 *  0b011111..PWM0_SM3_MUX_TRIG1
 *  0b100000..ENC0_CMP/POS_MATCH
 *  0b100001..ENC1_CMP/POS_MATCH
 *  0b100010..AOI0_OUT0
 *  0b100011..AOI0_OUT1
 *  0b100100..AOI0_OUT2
 *  0b100101..AOI0_OUT3
 *  0b100110..AOI1_OUT0
 *  0b100111..AOI1_OUT1
 *  0b101000..AOI1_OUT2
 *  0b101001..AOI1_OUT3
 *  0b101010..EXTTRIG_IN0
 *  0b101011..EXTTRIG_IN1
 *  0b101100..EXTTRIG_IN2
 *  0b101101..EXTTRIG_IN3
 *  0b101110..EXTTRIG_IN4
 *  0b101111..EXTTRIG_IN5
 *  0b110000..EXTTRIG_IN6
 *  0b110001..EXTTRIG_IN7
 *  0b110010..EXTTRIG_IN8
 *  0b110011..EXTTRIG_IN9
 *  0b110100..DMA0_TRIGOUT0
 *  0b110101..DMA0_TRIGOUT1
 *  0b110110..DMA0_TRIGOUT2
 */
#define INPUTMUX_PWM1_EXTCLK_TRIGIN(x)           (((uint32_t)(((uint32_t)(x)) << INPUTMUX_PWM1_EXTCLK_TRIGIN_SHIFT)) & INPUTMUX_PWM1_EXTCLK_TRIGIN_MASK)
/*! @} */

/*! @name AOI0_IN - AOI0 trigger inputs */
/*! @{ */

#define INPUTMUX_AOI0_IN_IN_MASK                 (0x3FU)
#define INPUTMUX_AOI0_IN_IN_SHIFT                (0U)
/*! IN - Input trigger assignments
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT1
 *  0b000010..SCT_OUT0
 *  0b000011..SCT_OUT1
 *  0b000100..SCT_OUT2
 *  0b000101..SCT_OUT3
 *  0b000110..T0_MAT3
 *  0b000111..T1_MAT3
 *  0b001000..T2_MAT3
 *  0b001001..T2_MAT2
 *  0b001010..T3_MAT2
 *  0b001011..T4_MAT2
 *  0b001100..ACMP0_OUT
 *  0b001101..GPIOINT_BMATCH
 *  0b001110..ADC0_IRQ
 *  0b001111..ADC1_IRQ
 *  0b010000..ADC0_tcomp[0]
 *  0b010001..ADC0_tcomp[1]
 *  0b010010..ADC0_tcomp[2]
 *  0b010011..ADC0_tcomp[3]
 *  0b010100..ADC1_tcomp[0]
 *  0b010101..ADC1_tcomp[1]
 *  0b010110..ADC1_tcomp[2]
 *  0b010111..ADC1_tcomp[3]
 *  0b011000..HSCMP0_OUT
 *  0b011001..HSCMP1_OUT
 *  0b011010..HSCMP2_OUT
 *  0b011011..PWM0_SM0_MUX_TRIG0
 *  0b011100..PWM0_SM0_MUX_TRIG1
 *  0b011101..PWM0_SM1_MUX_TRIG0
 *  0b011110..PWM0_SM1_MUX_TRIG1
 *  0b011111..PWM0_SM2_MUX_TRIG0
 *  0b100000..PWM0_SM2_MUX_TRIG1
 *  0b100001..PWM0_SM3_MUX_TRIG0
 *  0b100010..PWM0_SM3_MUX_TRIG1
 *  0b100011..PWM1_SM0_MUX_TRIG0
 *  0b100100..PWM1_SM0_MUX_TRIG1
 *  0b100101..PWM1_SM1_MUX_TRIG0
 *  0b100110..PWM1_SM1_MUX_TRIG1
 *  0b100111..PWM1_SM2_MUX_TRIG0
 *  0b101000..PWM1_SM2_MUX_TRIG1
 *  0b101001..PWM1_SM3_MUX_TRIG0
 *  0b101010..PWM1_SM3_MUX_TRIG1
 *  0b101011..ENC0_CMP/POS_MATCH
 *  0b101100..ENC1_CMP/POS_MATCH
 *  0b101101..EXTTRIG_IN0
 *  0b101110..EXTTRIG_IN1
 *  0b101111..EXTTRIG_IN2
 *  0b110000..EXTTRIG_IN3
 *  0b110001..Reserved
 *  0b110010..Reserved
 *  0b110011..DMA0_TRIGOUT0
 *  0b110100..DMA0_TRIGOUT1
 *  0b110101..DMA0_TRIGOUT2
 *  0b110110..DMA0_TRIGOUT3
 *  0b110111..DMA0_TRIGOUT4
 *  0b111000..DMA0_TRIGOUT5
 *  0b111001..DMA0_TRIGOUT6
 *  0b111010..DMA1_TRIGOUT0
 *  0b111011..DMA1_TRIGOUT1
 *  0b111100..DMA1_TRIGOUT2
 */
#define INPUTMUX_AOI0_IN_IN(x)                   (((uint32_t)(((uint32_t)(x)) << INPUTMUX_AOI0_IN_IN_SHIFT)) & INPUTMUX_AOI0_IN_IN_MASK)
/*! @} */

/* The count of INPUTMUX_AOI0_IN */
#define INPUTMUX_AOI0_INPUTTRIGGER0              (16U)

/*! @name AOI1_IN - AOI1 trigger inputs */
/*! @{ */

#define INPUTMUX_AOI1_IN_IN_MASK                 (0x3FU)
#define INPUTMUX_AOI1_IN_IN_SHIFT                (0U)
/*! IN - Input trigger assignments
 *  0b000000..PIN_INT0
 *  0b000001..PIN_INT1
 *  0b000010..SCT_OUT0
 *  0b000011..SCT_OUT1
 *  0b000100..SCT_OUT2
 *  0b000101..SCT_OUT3
 *  0b000110..T0_MAT3
 *  0b000111..T1_MAT3
 *  0b001000..T2_MAT3
 *  0b001001..T2_MAT2
 *  0b001010..T3_MAT2
 *  0b001011..T4_MAT2
 *  0b001100..ACMP0_OUT
 *  0b001101..GPIOINT_BMATCH
 *  0b001110..ADC0_IRQ
 *  0b001111..ADC1_IRQ
 *  0b010000..ADC0_tcomp[0]
 *  0b010001..ADC0_tcomp[1]
 *  0b010010..ADC0_tcomp[2]
 *  0b010011..ADC0_tcomp[3]
 *  0b010100..ADC1_tcomp[0]
 *  0b010101..ADC1_tcomp[1]
 *  0b010110..ADC1_tcomp[2]
 *  0b010111..ADC1_tcomp[3]
 *  0b011000..HSCMP0_OUT
 *  0b011001..HSCMP1_OUT
 *  0b011010..HSCMP2_OUT
 *  0b011011..PWM0_SM0_MUX_TRIG0
 *  0b011100..PWM0_SM0_MUX_TRIG1
 *  0b011101..PWM0_SM1_MUX_TRIG0
 *  0b011110..PWM0_SM1_MUX_TRIG1
 *  0b011111..PWM0_SM2_MUX_TRIG0
 *  0b100000..PWM0_SM2_MUX_TRIG1
 *  0b100001..PWM0_SM3_MUX_TRIG0
 *  0b100010..PWM0_SM3_MUX_TRIG1
 *  0b100011..PWM1_SM0_MUX_TRIG0
 *  0b100100..PWM1_SM0_MUX_TRIG1
 *  0b100101..PWM1_SM1_MUX_TRIG0
 *  0b100110..PWM1_SM1_MUX_TRIG1
 *  0b100111..PWM1_SM2_MUX_TRIG0
 *  0b101000..PWM1_SM2_MUX_TRIG1
 *  0b101001..PWM1_SM3_MUX_TRIG0
 *  0b101010..PWM1_SM3_MUX_TRIG1
 *  0b101011..ENC0_CMP/POS_MATCH
 *  0b101100..ENC1_CMP/POS_MATCH
 *  0b101101..EXTTRIG_IN0
 *  0b101110..EXTTRIG_IN1
 *  0b101111..EXTTRIG_IN2
 *  0b110000..EXTTRIG_IN3
 *  0b110001..Reserved
 *  0b110010..Reserved
 *  0b110011..DMA0_TRIGOUT0
 *  0b110100..DMA0_TRIGOUT1
 *  0b110101..DMA0_TRIGOUT2
 *  0b110110..DMA0_TRIGOUT3
 *  0b110111..DMA0_TRIGOUT4
 *  0b111000..DMA0_TRIGOUT5
 *  0b111001..DMA0_TRIGOUT6
 *  0b111010..DMA1_TRIGOUT0
 *  0b111011..DMA1_TRIGOUT1
 *  0b111100..DMA1_TRIGOUT2
 */
#define INPUTMUX_AOI1_IN_IN(x)                   (((uint32_t)(((uint32_t)(x)) << INPUTMUX_AOI1_IN_IN_SHIFT)) & INPUTMUX_AOI1_IN_IN_MASK)
/*! @} */

/* The count of INPUTMUX_AOI1_IN */
#define INPUTMUX_AOI1_INPUTTRIGGER0              (16U)

