nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
#define INPUTMUX_DMA0_REQEN1_SET_REQ_ENA19_MASK  (0x80000U)
#define INPUTMUX_DMA0_REQEN1_SET_REQ_ENA19_SHIFT (19U)
/*! REQ_ENA19 - Write : If bit #i = 1, bit #i in DMA0_REQEN1 register is set to 1; if bit #i = 0, no change in DMA0_REQEN1 register.
 */
#define INPUTMUX_DMA0_REQEN1_SET_REQ_ENA19(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN1_SET_REQ_ENA19_SHIFT)) & INPUTMUX_DMA0_REQEN1_SET_REQ_ENA19_MASK)
/*! @} */

/*! @name DMA0_REQEN0_CLR - Clear bits in DMA0_REQEN0 register */
/*! @{ */

#define INPUTMUX_DMA0_REQEN0_CLR_CLR0_MASK       (0x1U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR0_SHIFT      (0U)
/*! CLR0 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR0(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR0_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR0_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR1_MASK       (0x2U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR1_SHIFT      (1U)
/*! CLR1 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR1(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR1_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR1_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR2_MASK       (0x4U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR2_SHIFT      (2U)
/*! CLR2 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR2(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR2_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR2_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR3_MASK       (0x8U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR3_SHIFT      (3U)
/*! CLR3 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR3(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR3_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR3_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR4_MASK       (0x10U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR4_SHIFT      (4U)
/*! CLR4 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR4(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR4_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR4_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR5_MASK       (0x20U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR5_SHIFT      (5U)
/*! CLR5 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR5(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR5_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR5_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR6_MASK       (0x40U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR6_SHIFT      (6U)
/*! CLR6 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR6(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR6_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR6_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR7_MASK       (0x80U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR7_SHIFT      (7U)
/*! CLR7 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR7(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR7_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR7_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR8_MASK       (0x100U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR8_SHIFT      (8U)
/*! CLR8 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR8(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR8_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR8_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR9_MASK       (0x200U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR9_SHIFT      (9U)
/*! CLR9 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR9(x)         (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR9_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR9_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR10_MASK      (0x400U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR10_SHIFT     (10U)
/*! CLR10 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR10(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR10_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR10_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR11_MASK      (0x800U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR11_SHIFT     (11U)
/*! CLR11 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR11(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR11_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR11_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR12_MASK      (0x1000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR12_SHIFT     (12U)
/*! CLR12 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR12(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR12_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR12_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR13_MASK      (0x2000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR13_SHIFT     (13U)
/*! CLR13 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR13(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR13_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR13_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR14_MASK      (0x4000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR14_SHIFT     (14U)
/*! CLR14 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR14(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR14_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR14_MASK)

#define INPUTMUX_DMA0_REQEN0_CLR_CLR15_MASK      (0x8000U)
#define INPUTMUX_DMA0_REQEN0_CLR_CLR15_SHIFT     (15U)
/*! CLR15 - Write : If bit #i = 1, bit #i in DMA0_REQEN0 register is reset to 0; if bit #i = 0 , no change in DMA0_REQEN0 register.
 */
#define INPUTMUX_DMA0_REQEN0_CLR_CLR15(x)        (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_REQEN0_CLR_CLR15_SHIFT)) & INPUTMUX_DMA0_REQEN0_CLR_CLR15_MASK)

