nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET9_MASK     (0x200U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET9_SHIFT    (9U)
/*! SET9 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET9(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET9_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET9_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET10_MASK    (0x400U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET10_SHIFT   (10U)
/*! SET10 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET10(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET10_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET10_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET11_MASK    (0x800U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET11_SHIFT   (11U)
/*! SET11 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET11(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET11_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET11_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET12_MASK    (0x1000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET12_SHIFT   (12U)
/*! SET12 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET12(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET12_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET12_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET13_MASK    (0x2000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET13_SHIFT   (13U)
/*! SET13 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET13(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET13_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET13_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET14_MASK    (0x4000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET14_SHIFT   (14U)
/*! SET14 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET14(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET14_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET14_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET15_MASK    (0x8000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET15_SHIFT   (15U)
/*! SET15 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET15(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET15_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET15_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET16_MASK    (0x10000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET16_SHIFT   (16U)
/*! SET16 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET16(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET16_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET16_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET17_MASK    (0x20000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET17_SHIFT   (17U)
/*! SET17 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET17(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET17_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET17_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET18_MASK    (0x40000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET18_SHIFT   (18U)
/*! SET18 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET18(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET18_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET18_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET19_MASK    (0x80000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET19_SHIFT   (19U)
/*! SET19 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET19(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET19_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET19_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET20_MASK    (0x100000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET20_SHIFT   (20U)
/*! SET20 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET20(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET20_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET20_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET21_MASK    (0x200000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET21_SHIFT   (21U)
/*! SET21 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET21(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET21_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET21_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET22_MASK    (0x400000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET22_SHIFT   (22U)
/*! SET22 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET22(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET22_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET22_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET23_MASK    (0x800000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET23_SHIFT   (23U)
/*! SET23 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET23(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET23_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET23_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET24_MASK    (0x1000000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET24_SHIFT   (24U)
/*! SET24 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET24(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET24_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET24_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET25_MASK    (0x2000000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET25_SHIFT   (25U)
/*! SET25 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET25(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET25_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET25_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET26_MASK    (0x4000000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET26_SHIFT   (26U)
/*! SET26 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET26(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET26_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET26_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET27_MASK    (0x8000000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET27_SHIFT   (27U)
/*! SET27 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET27(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET27_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET27_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET28_MASK    (0x10000000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET28_SHIFT   (28U)
/*! SET28 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET28(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET28_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET28_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET29_MASK    (0x20000000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET29_SHIFT   (29U)
/*! SET29 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET29(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET29_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET29_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET30_MASK    (0x40000000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET30_SHIFT   (30U)
/*! SET30 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET30(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET30_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET30_MASK)

#define INPUTMUX_DMA0_ITRIGEN0_SET_SET31_MASK    (0x80000000U)
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET31_SHIFT   (31U)
/*! SET31 - Write : If bit #i = 1, bit #i in DMA0_ITRIGEN0 register is set to 1; if bit #i = 0 , no
 *    change in DMA0_ITRIGEN0 register.
 */
#define INPUTMUX_DMA0_ITRIGEN0_SET_SET31(x)      (((uint32_t)(((uint32_t)(x)) << INPUTMUX_DMA0_ITRIGEN0_SET_SET31_SHIFT)) & INPUTMUX_DMA0_ITRIGEN0_SET_SET31_MASK)
/*! @} */

/*! @name DMA0_ITRIGEN1_SET - Set bits in DMA0_ITRIGEN1 register */
/*! @{ */

