nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
#define PMC_PDSLEEPCFG0_PDEN_OPAMP1_MASK         (0x20000000U)
#define PMC_PDSLEEPCFG0_PDEN_OPAMP1_SHIFT        (29U)
/*! PDEN_OPAMP1 - Controls Operational Amplifier1 power during DEEP-SLEEP (always shut down during POWER-DOWN and DEEP-POWER-DOWN).
 *  0b0..Operational Amplifier is powered on during low power mode.
 *  0b1..Operational Amplifier is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_OPAMP1(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_OPAMP1_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_OPAMP1_MASK)

#define PMC_PDSLEEPCFG0_PDEN_OPAMP2_MASK         (0x40000000U)
#define PMC_PDSLEEPCFG0_PDEN_OPAMP2_SHIFT        (30U)
/*! PDEN_OPAMP2 - Controls Operational Amplifier2 power during DEEP-SLEEP (always shut down during POWER-DOWN and DEEP-POWER-DOWN).
 *  0b0..Operational Amplifier is powered on during low power mode.
 *  0b1..Operational Amplifier is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_OPAMP2(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_OPAMP2_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_OPAMP2_MASK)

#define PMC_PDSLEEPCFG0_PDEN_VREF_MASK           (0x80000000U)
#define PMC_PDSLEEPCFG0_PDEN_VREF_SHIFT          (31U)
/*! PDEN_VREF - Controls VREF power during DEEP-SLEEP (always shut down during POWER-DOWN and DEEP-POWER-DOWN).
 *  0b0..VREF is powered on during low power mode.
 *  0b1..VREF is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_VREF(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_VREF_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_VREF_MASK)
/*! @} */

/*! @name SRAMRETCTRL - Controls all SRAM instances power down modes during Low Power modes [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Software Reset] */
/*! @{ */

#define PMC_SRAMRETCTRL_RETEN_RAM_X0_MASK        (0x1U)
#define PMC_SRAMRETCTRL_RETEN_RAM_X0_SHIFT       (0U)
/*! RETEN_RAM_X0 - Controls RAM_X0 power down modes during low power modes.
 *  0b0..DEEP-SLEEP: the SRAM instance keeps the configuration it has before entering DEEP-SLEEP, what evere it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER-DOWN and DEEP-POWER-DOWN: the SRAM
 *       instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM is in 'Deep Sleep' mode (In this mode there is data retention).
 */
#define PMC_SRAMRETCTRL_RETEN_RAM_X0(x)          (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAM_X0_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAM_X0_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAM_00_MASK        (0x2U)
#define PMC_SRAMRETCTRL_RETEN_RAM_00_SHIFT       (1U)
/*! RETEN_RAM_00 - Controls RAM_00 power down modes during low power modes.
 *  0b0..DEEP-SLEEP: the SRAM instance keeps the configuration it has before entering DEEP-SLEEP, what evere it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER-DOWN and DEEP-POWER-DOWN: the SRAM
 *       instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM is in 'Deep Sleep' mode (In this mode there is data retention).
 */
#define PMC_SRAMRETCTRL_RETEN_RAM_00(x)          (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAM_00_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAM_00_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAM_01_MASK        (0x4U)
#define PMC_SRAMRETCTRL_RETEN_RAM_01_SHIFT       (2U)
/*! RETEN_RAM_01 - Controls RAM_01 power down modes during low power modes.
 *  0b0..DEEP-SLEEP: the SRAM instance keeps the configuration it has before entering DEEP-SLEEP, what evere it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER-DOWN and DEEP-POWER-DOWN: the SRAM
 *       instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM is in 'Deep Sleep' mode (In this mode there is data retention).
 */
#define PMC_SRAMRETCTRL_RETEN_RAM_01(x)          (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAM_01_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAM_01_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAM_02_MASK        (0x8U)
#define PMC_SRAMRETCTRL_RETEN_RAM_02_SHIFT       (3U)
/*! RETEN_RAM_02 - Controls RAM_02 power down modes during low power modes.
 *  0b0..DEEP-SLEEP: the SRAM instance keeps the configuration it has before entering DEEP-SLEEP, what evere it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER-DOWN and DEEP-POWER-DOWN: the SRAM
 *       instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM is in 'Deep Sleep' mode (In this mode there is data retention).
 */
#define PMC_SRAMRETCTRL_RETEN_RAM_02(x)          (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAM_02_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAM_02_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAM_03_MASK        (0x10U)
#define PMC_SRAMRETCTRL_RETEN_RAM_03_SHIFT       (4U)
/*! RETEN_RAM_03 - Controls RAM_03 power down modes during low power modes.
 *  0b0..DEEP-SLEEP: the SRAM instance keeps the configuration it has before entering DEEP-SLEEP, what evere it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER-DOWN and DEEP-POWER-DOWN: the SRAM
 *       instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM is in 'Deep Sleep' mode (In this mode there is data retention).
 */
#define PMC_SRAMRETCTRL_RETEN_RAM_03(x)          (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAM_03_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAM_03_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAM_10_MASK        (0x20U)
#define PMC_SRAMRETCTRL_RETEN_RAM_10_SHIFT       (5U)
/*! RETEN_RAM_10 - Controls RAM_10 power down modes during low power modes.
 *  0b0..DEEP-SLEEP: the SRAM instance keeps the configuration it has before entering DEEP-SLEEP, whatever it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER-DOWN and DEEP-POWER-DOWN: the SRAM
 *       instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM is in 'Deep Sleep' mode (In this mode there is data retention).
 */
#define PMC_SRAMRETCTRL_RETEN_RAM_10(x)          (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAM_10_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAM_10_MASK)

