nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
#define PMC_PDRUNCFG0_PDEN_OPAMP2_MASK           (0x40000000U)
#define PMC_PDRUNCFG0_PDEN_OPAMP2_SHIFT          (30U)
/*! PDEN_OPAMP2 - Controls power to Operational Amplifier2
 *  0b0..Operational Amplifier2 is powered on
 *  0b1..Operational Amplifier2 is powered down
 */
#define PMC_PDRUNCFG0_PDEN_OPAMP2(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_OPAMP2_SHIFT)) & PMC_PDRUNCFG0_PDEN_OPAMP2_MASK)

#define PMC_PDRUNCFG0_PDEN_VREF_MASK             (0x80000000U)
#define PMC_PDRUNCFG0_PDEN_VREF_SHIFT            (31U)
/*! PDEN_VREF - Controls power to VREF module
 *  0b0..VREF is powered on.
 *  0b1..VREF is powered down.
 */
#define PMC_PDRUNCFG0_PDEN_VREF(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_VREF_SHIFT)) & PMC_PDRUNCFG0_PDEN_VREF_MASK)
/*! @} */

/*! @name PDRUNCFG1 - Power configuration 1 */
/*! @{ */

#define PMC_PDRUNCFG1_PDEN_CMPBIAS_MASK          (0x1U)
#define PMC_PDRUNCFG1_PDEN_CMPBIAS_SHIFT         (0U)
/*! PDEN_CMPBIAS - Controls power of Comparators 1/2/3 bias.
 *  0b0..Comparators 1/2/3 bias is powered.
 *  0b1..Comparators 1/2/3 bias is powered down.
 */
#define PMC_PDRUNCFG1_PDEN_CMPBIAS(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_PDEN_CMPBIAS_SHIFT)) & PMC_PDRUNCFG1_PDEN_CMPBIAS_MASK)

#define PMC_PDRUNCFG1_PDEN_HSCMP0_DAC_MASK       (0x2U)
#define PMC_PDRUNCFG1_PDEN_HSCMP0_DAC_SHIFT      (1U)
/*! PDEN_HSCMP0_DAC - Controls power to High Speed Comparator0 DAC.
 *  0b0..High Speed Comparator0 DAC is powered.
 *  0b1..High Speed Comparator0 DAC is powered down.
 */
#define PMC_PDRUNCFG1_PDEN_HSCMP0_DAC(x)         (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_PDEN_HSCMP0_DAC_SHIFT)) & PMC_PDRUNCFG1_PDEN_HSCMP0_DAC_MASK)

#define PMC_PDRUNCFG1_PDEN_HSCMP1_DAC_MASK       (0x4U)
#define PMC_PDRUNCFG1_PDEN_HSCMP1_DAC_SHIFT      (2U)
/*! PDEN_HSCMP1_DAC - Controls power to High Speed Comparator1 DAC.
 *  0b0..High Speed Comparator1 DAC is powered.
 *  0b1..High Speed Comparator1 DAC is powered down.
 */
#define PMC_PDRUNCFG1_PDEN_HSCMP1_DAC(x)         (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_PDEN_HSCMP1_DAC_SHIFT)) & PMC_PDRUNCFG1_PDEN_HSCMP1_DAC_MASK)

#define PMC_PDRUNCFG1_PDEN_HSCMP2_DAC_MASK       (0x8U)
#define PMC_PDRUNCFG1_PDEN_HSCMP2_DAC_SHIFT      (3U)
/*! PDEN_HSCMP2_DAC - Controls power to High Speed Comparator2 DAC.
 *  0b0..High Speed Comparator2 DAC is powered.
 *  0b1..High Speed Comparator2 DAC is powered down.
 */
#define PMC_PDRUNCFG1_PDEN_HSCMP2_DAC(x)         (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_PDEN_HSCMP2_DAC_SHIFT)) & PMC_PDRUNCFG1_PDEN_HSCMP2_DAC_MASK)

#define PMC_PDRUNCFG1_PDEN_DAC0_MASK             (0x10U)
#define PMC_PDRUNCFG1_PDEN_DAC0_SHIFT            (4U)
/*! PDEN_DAC0 - Controls power to DAC0.
 *  0b0..DAC0 is powered.
 *  0b1..DAC0 is powered down.
 */
#define PMC_PDRUNCFG1_PDEN_DAC0(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_PDEN_DAC0_SHIFT)) & PMC_PDRUNCFG1_PDEN_DAC0_MASK)

#define PMC_PDRUNCFG1_PDEN_DAC1_MASK             (0x20U)
#define PMC_PDRUNCFG1_PDEN_DAC1_SHIFT            (5U)
/*! PDEN_DAC1 - Controls power to DAC1.
 *  0b0..DAC1 is powered.
 *  0b1..DAC1 is powered down.
 */
#define PMC_PDRUNCFG1_PDEN_DAC1(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_PDEN_DAC1_SHIFT)) & PMC_PDRUNCFG1_PDEN_DAC1_MASK)

#define PMC_PDRUNCFG1_PDEN_DAC2_MASK             (0x40U)
#define PMC_PDRUNCFG1_PDEN_DAC2_SHIFT            (6U)
/*! PDEN_DAC2 - Controls power to DAC2.
 *  0b0..DAC2 is powered.
 *  0b1..DAC2 is powered down.
 */
#define PMC_PDRUNCFG1_PDEN_DAC2(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_PDEN_DAC2_SHIFT)) & PMC_PDRUNCFG1_PDEN_DAC2_MASK)

#define PMC_PDRUNCFG1_STOPEN_DAC0_MASK           (0x80U)
#define PMC_PDRUNCFG1_STOPEN_DAC0_SHIFT          (7U)
/*! STOPEN_DAC0 - Controls DAC0 Stop mode.
 *  0b0..DAC0 Stop mode is disabled.
 *  0b1..DAC0 Stop mode is enabled.
 */
#define PMC_PDRUNCFG1_STOPEN_DAC0(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_STOPEN_DAC0_SHIFT)) & PMC_PDRUNCFG1_STOPEN_DAC0_MASK)

#define PMC_PDRUNCFG1_STOPEN_DAC1_MASK           (0x100U)
#define PMC_PDRUNCFG1_STOPEN_DAC1_SHIFT          (8U)
/*! STOPEN_DAC1 - Controls DAC1 Stop mode.
 *  0b0..DAC1 Stop mode is disabled.
 *  0b1..DAC1 Stop mode is enabled.
 */
#define PMC_PDRUNCFG1_STOPEN_DAC1(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_STOPEN_DAC1_SHIFT)) & PMC_PDRUNCFG1_STOPEN_DAC1_MASK)

#define PMC_PDRUNCFG1_STOPEN_DAC2_MASK           (0x200U)
#define PMC_PDRUNCFG1_STOPEN_DAC2_SHIFT          (9U)
/*! STOPEN_DAC2 - Controls DAC2 Stop mode.
 *  0b0..DAC2 Stop mode is disabled.
 *  0b1..DAC2 Stop mode is enabled.
 */
#define PMC_PDRUNCFG1_STOPEN_DAC2(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_STOPEN_DAC2_SHIFT)) & PMC_PDRUNCFG1_STOPEN_DAC2_MASK)
/*! @} */

/*! @name PDRUNCFGSET0 - Power configuration set 0 */
/*! @{ */

#define PMC_PDRUNCFGSET0_PDRUNCFGSET0_MASK       (0xFFFFFFFFU)
#define PMC_PDRUNCFGSET0_PDRUNCFGSET0_SHIFT      (0U)
/*! PDRUNCFGSET0 - Writing ones to this register sets the corresponding bit or bits in the PDRUNCFG0 register, if they are implemented.
 */
#define PMC_PDRUNCFGSET0_PDRUNCFGSET0(x)         (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFGSET0_PDRUNCFGSET0_SHIFT)) & PMC_PDRUNCFGSET0_PDRUNCFGSET0_MASK)
/*! @} */

/*! @name PDRUNCFGSET1 - Power configuration set 1 */
/*! @{ */

#define PMC_PDRUNCFGSET1_PDRUNCFGSET1_MASK       (0x3FFU)
#define PMC_PDRUNCFGSET1_PDRUNCFGSET1_SHIFT      (0U)
/*! PDRUNCFGSET1 - Writing ones to this register sets the corresponding bit or bits in the PDRUNCFG0 register, if they are implemented.
 */
#define PMC_PDRUNCFGSET1_PDRUNCFGSET1(x)         (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFGSET1_PDRUNCFGSET1_SHIFT)) & PMC_PDRUNCFGSET1_PDRUNCFGSET1_MASK)
/*! @} */

/*! @name PDRUNCFGCLR0 - Power configuration clear 0 */
/*! @{ */

#define PMC_PDRUNCFGCLR0_PDRUNCFGCLR0_MASK       (0xFFFFFFFFU)
#define PMC_PDRUNCFGCLR0_PDRUNCFGCLR0_SHIFT      (0U)
/*! PDRUNCFGCLR0 - Writing ones to this register clears the corresponding bit or bits in the PDRUNCFG0 register, if they are implemented.
 */
#define PMC_PDRUNCFGCLR0_PDRUNCFGCLR0(x)         (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFGCLR0_PDRUNCFGCLR0_SHIFT)) & PMC_PDRUNCFGCLR0_PDRUNCFGCLR0_MASK)
/*! @} */

/*! @name PDRUNCFGCLR1 - Power configuration clear 1 */
/*! @{ */

