nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
#define PMC_PDRUNCFGCLR1_PDRUNCFGCLR1_MASK       (0x3FFU)
#define PMC_PDRUNCFGCLR1_PDRUNCFGCLR1_SHIFT      (0U)
/*! PDRUNCFGCLR1 - Writing ones to this register clears the corresponding bit or bits in the PDRUNCFG0 register, if they are implemented.
 */
#define PMC_PDRUNCFGCLR1_PDRUNCFGCLR1(x)         (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFGCLR1_PDRUNCFGCLR1_SHIFT)) & PMC_PDRUNCFGCLR1_PDRUNCFGCLR1_MASK)
/*! @} */

/*! @name SRAMCTRL - All SRAMs common control signals [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Software Reset] */
/*! @{ */

#define PMC_SRAMCTRL_SMB_MASK                    (0x3U)
#define PMC_SRAMCTRL_SMB_SHIFT                   (0U)
/*! SMB - Source Biasing voltage.
 *  0b00..Low leakage.
 *  0b01..Medium leakage.
 *  0b10..Highest leakage.
 *  0b11..Disable.
 */
#define PMC_SRAMCTRL_SMB(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL_SMB_SHIFT)) & PMC_SRAMCTRL_SMB_MASK)
/*! @} */

/*! @name SRAMCTRL0 - RAM_X0, and RAM_00 to RAM_30 power modes controls [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset] When [LS, LSDEL, DSB, DSBDEL] is: 0011 : Normal Mode 1111 : Light sleep mode 0100 : Deep-sleep mode 1100 : Shut down Mode */
/*! @{ */

#define PMC_SRAMCTRL0_RAM_X0_LS_MASK             (0x1U)
#define PMC_SRAMCTRL0_RAM_X0_LS_SHIFT            (0U)
/*! RAM_X0_LS - RAM_X0 Light Sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_X0_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_X0_LS_SHIFT)) & PMC_SRAMCTRL0_RAM_X0_LS_MASK)

#define PMC_SRAMCTRL0_RAM_X0_DSB_MASK            (0x2U)
#define PMC_SRAMCTRL0_RAM_X0_DSB_SHIFT           (1U)
/*! RAM_X0_DSB - RAM_X0 Deep sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_X0_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_X0_DSB_SHIFT)) & PMC_SRAMCTRL0_RAM_X0_DSB_MASK)

#define PMC_SRAMCTRL0_RAM_X0_DSBDEL_MASK         (0x4U)
#define PMC_SRAMCTRL0_RAM_X0_DSBDEL_SHIFT        (2U)
/*! RAM_X0_DSBDEL - RAM_X0 Deep sleep delayed.
 */
#define PMC_SRAMCTRL0_RAM_X0_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_X0_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_X0_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAM_X0_LSDEL_MASK          (0x8U)
#define PMC_SRAMCTRL0_RAM_X0_LSDEL_SHIFT         (3U)
/*! RAM_X0_LSDEL - RAM_X0 Sleep mode disable.
 */
#define PMC_SRAMCTRL0_RAM_X0_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_X0_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_X0_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAM_00_LS_MASK             (0x10U)
#define PMC_SRAMCTRL0_RAM_00_LS_SHIFT            (4U)
/*! RAM_00_LS - RAM_00 Light Sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_00_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_00_LS_SHIFT)) & PMC_SRAMCTRL0_RAM_00_LS_MASK)

#define PMC_SRAMCTRL0_RAM_00_DSB_MASK            (0x20U)
#define PMC_SRAMCTRL0_RAM_00_DSB_SHIFT           (5U)
/*! RAM_00_DSB - RAM_00 Deep sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_00_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_00_DSB_SHIFT)) & PMC_SRAMCTRL0_RAM_00_DSB_MASK)

#define PMC_SRAMCTRL0_RAM_00_DSBDEL_MASK         (0x40U)
#define PMC_SRAMCTRL0_RAM_00_DSBDEL_SHIFT        (6U)
/*! RAM_00_DSBDEL - RAM_00 Deep sleep delayed.
 */
#define PMC_SRAMCTRL0_RAM_00_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_00_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_00_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAM_00_LSDEL_MASK          (0x80U)
#define PMC_SRAMCTRL0_RAM_00_LSDEL_SHIFT         (7U)
/*! RAM_00_LSDEL - RAM_00 Sleep mode disable.
 */
#define PMC_SRAMCTRL0_RAM_00_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_00_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_00_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAM_01_LS_MASK             (0x100U)
#define PMC_SRAMCTRL0_RAM_01_LS_SHIFT            (8U)
/*! RAM_01_LS - RAM_01 Light Sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_01_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_01_LS_SHIFT)) & PMC_SRAMCTRL0_RAM_01_LS_MASK)

#define PMC_SRAMCTRL0_RAM_01_DSB_MASK            (0x200U)
#define PMC_SRAMCTRL0_RAM_01_DSB_SHIFT           (9U)
/*! RAM_01_DSB - RAM_01 Deep sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_01_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_01_DSB_SHIFT)) & PMC_SRAMCTRL0_RAM_01_DSB_MASK)

#define PMC_SRAMCTRL0_RAM_01_DSBDEL_MASK         (0x400U)
#define PMC_SRAMCTRL0_RAM_01_DSBDEL_SHIFT        (10U)
/*! RAM_01_DSBDEL - RAM_01 Deep sleep delayed.
 */
#define PMC_SRAMCTRL0_RAM_01_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_01_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_01_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAM_01_LSDEL_MASK          (0x800U)
#define PMC_SRAMCTRL0_RAM_01_LSDEL_SHIFT         (11U)
/*! RAM_01_LSDEL - RAM_01 Sleep mode disable.
 */
#define PMC_SRAMCTRL0_RAM_01_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_01_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_01_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAM_02_LS_MASK             (0x1000U)
#define PMC_SRAMCTRL0_RAM_02_LS_SHIFT            (12U)
/*! RAM_02_LS - RAM_02 Light Sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_02_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_02_LS_SHIFT)) & PMC_SRAMCTRL0_RAM_02_LS_MASK)

#define PMC_SRAMCTRL0_RAM_02_DSB_MASK            (0x2000U)
#define PMC_SRAMCTRL0_RAM_02_DSB_SHIFT           (13U)
/*! RAM_02_DSB - RAM_02 Deep sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_02_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_02_DSB_SHIFT)) & PMC_SRAMCTRL0_RAM_02_DSB_MASK)

#define PMC_SRAMCTRL0_RAM_02_DSBDEL_MASK         (0x4000U)
#define PMC_SRAMCTRL0_RAM_02_DSBDEL_SHIFT        (14U)
/*! RAM_02_DSBDEL - RAM_02 Deep sleep delayed.
 */
#define PMC_SRAMCTRL0_RAM_02_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_02_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_02_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAM_02_LSDEL_MASK          (0x8000U)
#define PMC_SRAMCTRL0_RAM_02_LSDEL_SHIFT         (15U)
/*! RAM_02_LSDEL - RAM_02 Sleep mode disable.
 */
#define PMC_SRAMCTRL0_RAM_02_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_02_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_02_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAM_03_LS_MASK             (0x10000U)
#define PMC_SRAMCTRL0_RAM_03_LS_SHIFT            (16U)
/*! RAM_03_LS - RAM_03 Light Sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_03_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_03_LS_SHIFT)) & PMC_SRAMCTRL0_RAM_03_LS_MASK)

#define PMC_SRAMCTRL0_RAM_03_DSB_MASK            (0x20000U)
#define PMC_SRAMCTRL0_RAM_03_DSB_SHIFT           (17U)
/*! RAM_03_DSB - RAM_03 Deep sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_03_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_03_DSB_SHIFT)) & PMC_SRAMCTRL0_RAM_03_DSB_MASK)

#define PMC_SRAMCTRL0_RAM_03_DSBDEL_MASK         (0x40000U)
#define PMC_SRAMCTRL0_RAM_03_DSBDEL_SHIFT        (18U)
/*! RAM_03_DSBDEL - RAM_03 Deep sleep delayed.
 */
#define PMC_SRAMCTRL0_RAM_03_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_03_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_03_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAM_03_LSDEL_MASK          (0x80000U)
#define PMC_SRAMCTRL0_RAM_03_LSDEL_SHIFT         (19U)
/*! RAM_03_LSDEL - RAM_03 Sleep mode disable.
 */
#define PMC_SRAMCTRL0_RAM_03_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_03_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_03_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAM_10_LS_MASK             (0x100000U)
#define PMC_SRAMCTRL0_RAM_10_LS_SHIFT            (20U)
/*! RAM_10_LS - RAM_10 Light Sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_10_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_10_LS_SHIFT)) & PMC_SRAMCTRL0_RAM_10_LS_MASK)

#define PMC_SRAMCTRL0_RAM_10_DSB_MASK            (0x200000U)
#define PMC_SRAMCTRL0_RAM_10_DSB_SHIFT           (21U)
/*! RAM_10_DSB - RAM_10 Deep sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_10_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_10_DSB_SHIFT)) & PMC_SRAMCTRL0_RAM_10_DSB_MASK)

#define PMC_SRAMCTRL0_RAM_10_DSBDEL_MASK         (0x400000U)
#define PMC_SRAMCTRL0_RAM_10_DSBDEL_SHIFT        (22U)
/*! RAM_10_DSBDEL - RAM_10 Deep sleep delayed.
 */
#define PMC_SRAMCTRL0_RAM_10_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_10_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_10_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAM_10_LSDEL_MASK          (0x800000U)
#define PMC_SRAMCTRL0_RAM_10_LSDEL_SHIFT         (23U)
/*! RAM_10_LSDEL - RAM_10 Sleep mode disable.
 */
#define PMC_SRAMCTRL0_RAM_10_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_10_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_10_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAM_20_LS_MASK             (0x1000000U)
#define PMC_SRAMCTRL0_RAM_20_LS_SHIFT            (24U)
/*! RAM_20_LS - RAM_20 Light Sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_20_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_20_LS_SHIFT)) & PMC_SRAMCTRL0_RAM_20_LS_MASK)

#define PMC_SRAMCTRL0_RAM_20_DSB_MASK            (0x2000000U)
#define PMC_SRAMCTRL0_RAM_20_DSB_SHIFT           (25U)
/*! RAM_20_DSB - RAM_20 Deep sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_20_DSB(x)              (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_20_DSB_SHIFT)) & PMC_SRAMCTRL0_RAM_20_DSB_MASK)

#define PMC_SRAMCTRL0_RAM_20_DSBDEL_MASK         (0x4000000U)
#define PMC_SRAMCTRL0_RAM_20_DSBDEL_SHIFT        (26U)
/*! RAM_20_DSBDEL - RAM_20 Deep sleep delayed.
 */
#define PMC_SRAMCTRL0_RAM_20_DSBDEL(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_20_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_20_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAM_20_LSDEL_MASK          (0x8000000U)
#define PMC_SRAMCTRL0_RAM_20_LSDEL_SHIFT         (27U)
/*! RAM_20_LSDEL - RAM_20 Sleep mode disable.
 */
#define PMC_SRAMCTRL0_RAM_20_LSDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_20_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAM_20_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAM_30_LS_MASK             (0x10000000U)
#define PMC_SRAMCTRL0_RAM_30_LS_SHIFT            (28U)
/*! RAM_30_LS - RAM_30 Light Sleep mode.
 */
#define PMC_SRAMCTRL0_RAM_30_LS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM_30_LS_SHIFT)) & PMC_SRAMCTRL0_RAM_30_LS_MASK)

