nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
#define SYSCON_FLEXSPICLKDIV_DIV_MASK            (0x7U)
#define SYSCON_FLEXSPICLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock divider value.
 */
#define SYSCON_FLEXSPICLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXSPICLKDIV_DIV_SHIFT)) & SYSCON_FLEXSPICLKDIV_DIV_MASK)

#define SYSCON_FLEXSPICLKDIV_RESET_MASK          (0x20000000U)
#define SYSCON_FLEXSPICLKDIV_RESET_SHIFT         (29U)
/*! RESET - Resets the divider counter.
 *  0b1..Divider is reset.
 *  0b0..Divider is not reset.
 */
#define SYSCON_FLEXSPICLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXSPICLKDIV_RESET_SHIFT)) & SYSCON_FLEXSPICLKDIV_RESET_MASK)

#define SYSCON_FLEXSPICLKDIV_HALT_MASK           (0x40000000U)
#define SYSCON_FLEXSPICLKDIV_HALT_SHIFT          (30U)
/*! HALT - Halts the divider counter.
 *  0b1..Divider clock is stopped.
 *  0b0..Divider clock is running.
 */
#define SYSCON_FLEXSPICLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXSPICLKDIV_HALT_SHIFT)) & SYSCON_FLEXSPICLKDIV_HALT_MASK)

#define SYSCON_FLEXSPICLKDIV_UNSTAB_MASK         (0x80000000U)
#define SYSCON_FLEXSPICLKDIV_UNSTAB_SHIFT        (31U)
/*! UNSTAB - Divider status flag.
 *  0b1..Clock frequency is not stable.
 *  0b0..Divider clock is stable.
 */
#define SYSCON_FLEXSPICLKDIV_UNSTAB(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXSPICLKDIV_UNSTAB_SHIFT)) & SYSCON_FLEXSPICLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name CDPA_ENABLE - Enable protection */
/*! @{ */

#define SYSCON_CDPA_ENABLE_CDPA_ENABLE_MASK      (0x3U)
#define SYSCON_CDPA_ENABLE_CDPA_ENABLE_SHIFT     (0U)
/*! CDPA_ENABLE - Enable control
 */
#define SYSCON_CDPA_ENABLE_CDPA_ENABLE(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_CDPA_ENABLE_CDPA_ENABLE_SHIFT)) & SYSCON_CDPA_ENABLE_CDPA_ENABLE_MASK)
/*! @} */

/*! @name CDPA_ENABLE_DP - Enable protection duplicate */
/*! @{ */

#define SYSCON_CDPA_ENABLE_DP_CDPA_ENABLE_DP_MASK (0x3U)
#define SYSCON_CDPA_ENABLE_DP_CDPA_ENABLE_DP_SHIFT (0U)
/*! CDPA_ENABLE_DP - Enable control
 */
#define SYSCON_CDPA_ENABLE_DP_CDPA_ENABLE_DP(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON_CDPA_ENABLE_DP_CDPA_ENABLE_DP_SHIFT)) & SYSCON_CDPA_ENABLE_DP_CDPA_ENABLE_DP_MASK)
/*! @} */

/*! @name CDPA_CONFIG - CDPA base address */
/*! @{ */

#define SYSCON_CDPA_CONFIG_CDPA_START_PAGE_MASK  (0x1FFU)
#define SYSCON_CDPA_CONFIG_CDPA_START_PAGE_SHIFT (0U)
/*! CDPA_START_PAGE - Specifies the size of CDPA in number of pages.
 */
#define SYSCON_CDPA_CONFIG_CDPA_START_PAGE(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_CDPA_CONFIG_CDPA_START_PAGE_SHIFT)) & SYSCON_CDPA_CONFIG_CDPA_START_PAGE_MASK)
/*! @} */

/*! @name FLASH_HIDING_LOCKOUT_ADDR - Flash hiding lockout address */
/*! @{ */

#define SYSCON_FLASH_HIDING_LOCKOUT_ADDR_flash_hiding_lockout_addr_MASK (0xFFFFFFFFU)
#define SYSCON_FLASH_HIDING_LOCKOUT_ADDR_flash_hiding_lockout_addr_SHIFT (0U)
/*! flash_hiding_lockout_addr - while flash hiding is disabled, register write is locked.
 */
#define SYSCON_FLASH_HIDING_LOCKOUT_ADDR_flash_hiding_lockout_addr(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_FLASH_HIDING_LOCKOUT_ADDR_flash_hiding_lockout_addr_SHIFT)) & SYSCON_FLASH_HIDING_LOCKOUT_ADDR_flash_hiding_lockout_addr_MASK)
/*! @} */

/*! @name FLASH_HIDING_BASE_ADDR - Flash hiding base address */
/*! @{ */

#define SYSCON_FLASH_HIDING_BASE_ADDR_flash_hiding_base_addr_MASK (0x3FFFFU)
#define SYSCON_FLASH_HIDING_BASE_ADDR_flash_hiding_base_addr_SHIFT (0U)
/*! flash_hiding_base_addr - Base address for flash hiding
 */
#define SYSCON_FLASH_HIDING_BASE_ADDR_flash_hiding_base_addr(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_FLASH_HIDING_BASE_ADDR_flash_hiding_base_addr_SHIFT)) & SYSCON_FLASH_HIDING_BASE_ADDR_flash_hiding_base_addr_MASK)
/*! @} */

/*! @name FLASH_HIDING_BASE_DP_ADDR - Flash hiding base DP address */
/*! @{ */

#define SYSCON_FLASH_HIDING_BASE_DP_ADDR_flash_hiding_base_addr_MASK (0x3FFFFU)
#define SYSCON_FLASH_HIDING_BASE_DP_ADDR_flash_hiding_base_addr_SHIFT (0U)
/*! flash_hiding_base_addr - Base address for flash hiding
 */
#define SYSCON_FLASH_HIDING_BASE_DP_ADDR_flash_hiding_base_addr(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_FLASH_HIDING_BASE_DP_ADDR_flash_hiding_base_addr_SHIFT)) & SYSCON_FLASH_HIDING_BASE_DP_ADDR_flash_hiding_base_addr_MASK)
/*! @} */

/*! @name FLASH_HIDING_SIZE_ADDR - Hiding size address */
/*! @{ */

#define SYSCON_FLASH_HIDING_SIZE_ADDR_flash_hiding_size_addr_MASK (0x3FFFFU)
#define SYSCON_FLASH_HIDING_SIZE_ADDR_flash_hiding_size_addr_SHIFT (0U)
/*! flash_hiding_size_addr - Size address for flash hiding
 */
#define SYSCON_FLASH_HIDING_SIZE_ADDR_flash_hiding_size_addr(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_FLASH_HIDING_SIZE_ADDR_flash_hiding_size_addr_SHIFT)) & SYSCON_FLASH_HIDING_SIZE_ADDR_flash_hiding_size_addr_MASK)
/*! @} */

/*! @name FLASH_HIDING_SIZE_DP_ADDR - Hiding size DP address */
/*! @{ */

#define SYSCON_FLASH_HIDING_SIZE_DP_ADDR_flash_hiding_size_dp_addr_MASK (0x3FFFFU)
#define SYSCON_FLASH_HIDING_SIZE_DP_ADDR_flash_hiding_size_dp_addr_SHIFT (0U)
/*! flash_hiding_size_dp_addr - Size address for flash hiding
 */
#define SYSCON_FLASH_HIDING_SIZE_DP_ADDR_flash_hiding_size_dp_addr(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_FLASH_HIDING_SIZE_DP_ADDR_flash_hiding_size_dp_addr_SHIFT)) & SYSCON_FLASH_HIDING_SIZE_DP_ADDR_flash_hiding_size_dp_addr_MASK)
/*! @} */

/*! @name PLLCLKDIVSEL - PLL clock divider clock selection */
/*! @{ */

#define SYSCON_PLLCLKDIVSEL_SEL_MASK             (0x7U)
#define SYSCON_PLLCLKDIVSEL_SEL_SHIFT            (0U)
/*! SEL - Flexspi clock select
 *  0b000..PLL0 clock
 *  0b001..PLL1 clock
 *  0b010..No clock
 *  0b011..No clock
 *  0b100..No clock
 *  0b101..No clock
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_PLLCLKDIVSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_PLLCLKDIVSEL_SEL_SHIFT)) & SYSCON_PLLCLKDIVSEL_SEL_MASK)
/*! @} */

/*! @name I3CFCLKSEL - I3C functional clock selection */
/*! @{ */

#define SYSCON_I3CFCLKSEL_SEL_MASK               (0x7U)
#define SYSCON_I3CFCLKSEL_SEL_SHIFT              (0U)
/*! SEL - I3C clock select
 *  0b000..Main clock
 *  0b001..FRO_HF_DIV
 *  0b010..No clock
 *  0b011..No clock
 *  0b100..No clock
 *  0b101..No clock
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_I3CFCLKSEL_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CFCLKSEL_SEL_SHIFT)) & SYSCON_I3CFCLKSEL_SEL_MASK)
/*! @} */

/*! @name I3CFCLKSTCSEL - I3C FCLK_STC clock selection */
/*! @{ */

