nxp-mcuxpresso/mcux-sdk/devices/LPC5536/LPC5536.h
#define SYSCON_AUTOCLKGATEOVERRIDE_SYSCON_MASK   (0x8000U)
#define SYSCON_AUTOCLKGATEOVERRIDE_SYSCON_SHIFT  (15U)
/*! SYSCON - Control automatic clock gating of synchronous system controller registers bank.
 *  0b1..Automatic clock gating is overridden (Clock gating is disabled).
 *  0b0..Automatic clock gating is not overridden.
 */
#define SYSCON_AUTOCLKGATEOVERRIDE_SYSCON(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE_SYSCON_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE_SYSCON_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE_ENABLEUPDATE_MASK (0xFFFF0000U)
#define SYSCON_AUTOCLKGATEOVERRIDE_ENABLEUPDATE_SHIFT (16U)
/*! ENABLEUPDATE - The value 0xC0DE must be written for AUTOCLKGATEOVERRIDE registers fields updates to have effect.
 *  0b1100000011011110..Bit Fields 0 - 15 of this register are updated
 *  0b0000000000000000..Bit Fields 0 - 15 of this register are not updated
 */
#define SYSCON_AUTOCLKGATEOVERRIDE_ENABLEUPDATE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE_ENABLEUPDATE_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE_ENABLEUPDATE_MASK)
/*! @} */

/*! @name GPIOPSYNC - GPIO Synchronization */
/*! @{ */

#define SYSCON_GPIOPSYNC_PSYNC_MASK              (0x1U)
#define SYSCON_GPIOPSYNC_PSYNC_SHIFT             (0U)
/*! PSYNC - Enable bypass of the first stage of synchronization inside GPIO_INT module.
 *  0b1..Bypass of the first stage of synchronization inside GPIO_INT module.
 *  0b0..Use the first stage of synchronization inside GPIO_INT module.
 */
#define SYSCON_GPIOPSYNC_PSYNC(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_GPIOPSYNC_PSYNC_SHIFT)) & SYSCON_GPIOPSYNC_PSYNC_MASK)
/*! @} */

/*! @name AUTOCLKGATEOVERRIDE1 - Control automatic clock gating */
/*! @{ */

#define SYSCON_AUTOCLKGATEOVERRIDE1_DAC0_MASK    (0x1U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_DAC0_SHIFT   (0U)
/*! DAC0 - DAC0
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_DAC0(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_DAC0_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_DAC0_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE1_DAC1_MASK    (0x2U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_DAC1_SHIFT   (1U)
/*! DAC1 - DAC1
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_DAC1(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_DAC1_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_DAC1_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE1_DAC2_MASK    (0x4U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_DAC2_SHIFT   (2U)
/*! DAC2 - DAC2
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_DAC2(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_DAC2_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_DAC2_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP0_MASK  (0x8U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP0_SHIFT (3U)
/*! OPAMP0 - OPAMP0
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP0(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP0_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP0_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP1_MASK  (0x10U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP1_SHIFT (4U)
/*! OPAMP1 - OPAMP1
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP1(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP1_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP1_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP2_MASK  (0x20U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP2_SHIFT (5U)
/*! OPAMP2 - OPAMP2
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP2(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP2_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_OPAMP2_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP0_MASK  (0x40U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP0_SHIFT (6U)
/*! HSCMP0 - HSCMP0
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP0(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP0_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP0_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP1_MASK  (0x80U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP1_SHIFT (7U)
/*! HSCMP1 - HSCMP0
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP1(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP1_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP1_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP2_MASK  (0x100U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP2_SHIFT (8U)
/*! HSCMP2 - HSCMP2
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP2(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP2_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_HSCMP2_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE1_VREF_MASK    (0x200U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_VREF_SHIFT   (9U)
/*! VREF - VREF
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_VREF(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_VREF_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_VREF_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE1_PWM0_MASK    (0x400U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_PWM0_SHIFT   (10U)
/*! PWM0 - PWM0
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_PWM0(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_PWM0_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_PWM0_MASK)

#define SYSCON_AUTOCLKGATEOVERRIDE1_PWM1_MASK    (0x800U)
#define SYSCON_AUTOCLKGATEOVERRIDE1_PWM1_SHIFT   (11U)
/*! PWM1 - PWM1
 */
#define SYSCON_AUTOCLKGATEOVERRIDE1_PWM1(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTOCLKGATEOVERRIDE1_PWM1_SHIFT)) & SYSCON_AUTOCLKGATEOVERRIDE1_PWM1_MASK)
/*! @} */

/*! @name ENABLE_MEM_PARITY_ECC_CHECK - Memory parity ECC enable */
/*! @{ */

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAMx_MASK (0x1U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAMx_SHIFT (0U)
/*! ENABLE_RAMx - Enable RAMx parity error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAMx(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAMx_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAMx_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM00_MASK (0x2U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM00_SHIFT (1U)
/*! ENABLE_RAM00 - Enable RAM00 parity error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM00(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM00_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM00_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM01_MASK (0x4U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM01_SHIFT (2U)
/*! ENABLE_RAM01 - Enable RAM01 parity error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM01(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM01_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAM01_MASK)

#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAMx02_MASK (0x8U)
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAMx02_SHIFT (3U)
/*! ENABLE_RAMx02 - Enable RAMx02 parity error check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAMx02(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAMx02_SHIFT)) & SYSCON_ENABLE_MEM_PARITY_ECC_CHECK_ENABLE_RAMx02_MASK)

